{
  "pagination": {
    "pageNumber": 1,
    "pageSize": 50
  },
  "results": [
    {
      "listingNumber": 901126,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Lifestyle",
      "geoLat": -36.670277,
      "geoLong": 174.65317,
      "geoCodeWgs": "POINT (174.65318298339844 -36.6702766418457)",
      "street": "10 Dairy Stream Road",
      "streetNumber": "10",
      "streetOnly": "Dairy Stream Road",
      "suburb": "Dairy Flat",
      "region": "Rodney District",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7msgr.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7msgs.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7msgt.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7msgv.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7msgw.jpg"
      ],
      "imageCount": 30,
      "video": "www.youtube.com/embed/4megbmY3AAc?rel=0",
      "price": "For Sale by Tender",
      "settlementDate": "2025-03-10T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "Stunning Lifestyle in Future Urban Zone",
      "adSummary": "This is an incredibly rare opportunity to own a stunning estate in the heart of Dairy Flat. Not only does it offer the full experience of luxurious estate living, but it also allows you to landbank for a future with unlimited investment potential.\n\nSet back from the main road, it is quiet and private. The nearly square-shaped, gently rolling 3.1245 hectares of land is bathed in sunlight all day and surrounded by breathtaking scenery. The current owners, who have lived here for over 20 years, have perfectly designed the layout of the estate according to the land’s unique features, meticulously maintaining the gardens and managing the pastures, all while enjoying a peaceful, idyllic rural lifestyle.\n\nThe home meets almost all your desires for a relaxing lifestyle. Every room, from the lounge, kitchen, and living room to each bedroom, offers beautiful views of the garden. The spacious living area includes a large lounge, open-plan kitchen with walk-in pantry, and a cozy family living room, providing a comfortable and expansive leisure space. Downstairs, there are three large bedrooms, a shared bathroom, a separate toilet, and a double garage. Upstairs is the master’s private living space, featuring a spacious master bedroom with an ensuite, a walk-in wardrobe, and a connecting balcony with scenic views.\n\nThe location is excellent, situated in the core of Dairy Flat, just a few minutes drives to Albany Mega Centre, and the central of Silverdale/Millwater. ~#~ Stunning Lifestyle in Future Urban Zone ~#~ Dairy Stream Road Dairy Flat  Rodney District  Garage Garaging  Double Garaging  Brick Exterior  Open Plan Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Local Views  Mixed Section Con  Metal Tile Roof  Spa Features  Concrete Base  Fully Fenced Fencing  Lifestyle Use  Family Rooms  Separate Lounge Rooms  Dining Room Rooms  Land Chattels Pumps Land Chattels  Rural Water Tank Rural  Kent Style Fire Heating  Heating Other Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Stove Chattels  Other Chattels Chattels  Septic ...",
      "nextOpenHome": "2024-11-09T23:00:00+00:00",
      "overlay": "",
      "isGSTInclusive": true,
      "landUse": [
        "Lifestyle"
      ],
      "floorArea": 0,
      "landArea": 31245,
      "pendingLiveDate": "2024-10-21T11:00:00+00:00",
      "tenderDateTime": "2024-11-10T23:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-21T19:45:35+00:00"
    },
    {
      "listingNumber": 898666,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.885662,
      "geoLong": 174.7644,
      "geoCodeWgs": "POINT (174.76441955566406 -36.885665893554688)",
      "street": "48 Disraeli Street",
      "streetNumber": "48",
      "streetOnly": "Disraeli Street",
      "suburb": "Mt Eden",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m4t0.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4tt.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4ts.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4t4.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4t5.jpg"
      ],
      "imageCount": 14,
      "video": "www.youtube.com/embed/ThnWrJ7D5sA?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2025-03-05T11:00:00+00:00",
      "bedroomCount": 5,
      "bathroomCount": 3,
      "parkingCount": 6,
      "adHeadline": "Double Grammar - 986m2 MHSZ",
      "adSummary": "Welcome families, lifestlyers and entertainers...here is the home of your dreams!\n\nThis large elevated Art Deco property plus the 2 storey garden cottage offer all who live here extraordinary living. Loved for the past 16 years by an award winning interior designer and her creative hubby, curated spaces are jam packed with thoughtful design, fabulous views and splashes of colour - every corner of this home is just delicious! Beautifully set on 986m2 of North facing outdoor living and gardens...you have just found your very own House of Fun!\n\n• Large garden cottage for extended living, games room and/or work from home\n• 986m2\n• Ample off street parking\n• Zones: Kohia Terrace; ANI; Epsom Girls Grammar; Auckland Grammar ~#~ Double Grammar - 986m2 MHSZ ~#~ Disraeli Street Mt Eden  Auckland City  Off Street Parking Garaging  Double Carport Garaging  Carport Garaging  Plaster Exterior  Brick Exterior  Combined Kitchen Dining  Designer Kitchen  Sep Bathrooms Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Mixed Joinery  Wide Views  Mixed Section Con  Slate Tile Roof  Polished Floors Features  Wooden Base  Concrete Base  Partially Fenced Fencing  Family Rooms  Separate Laundry Rooms  Separate Lounge Rooms  Office/Study Rooms  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Blinds Chattels  Dishwasher Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Refrigerator Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T01:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 986,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:30:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-15T13:31:05+00:00"
    },
    {
      "listingNumber": 899570,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.87511,
      "geoLong": 174.7589,
      "geoCodeWgs": "POINT (174.75889587402344 -36.8751106262207)",
      "street": "29 Bellevue Road",
      "streetNumber": "29",
      "streetOnly": "Bellevue Road",
      "suburb": "Mt Eden",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m7hp.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7ht.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ky7v.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7hv.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m08e.jpg"
      ],
      "imageCount": 30,
      "video": "www.youtube.com/embed/-jfKayR7Oq0?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 7,
      "adHeadline": "Stunning Mt Eden Villa in DGZ",
      "adSummary": "Your family lifestyle upgrade is here with this very special modernised villa in the coveted triple Grammar zone and walking distance to the village.\n\nRevel in spacious and sophisticated living with two separate lounges, four bedrooms, two bathrooms and an excellent connection between indoors and out. Crisp contemporary styling throughout highlights the classic polished timber floors that flow through to the substantial main open plan living, kitchen and dining at the rear. \n\nCentred by the well-appointed gourmand’s kitchen with quality appliances, abundant storage and an elongated breakfast bar for informal gatherings, the whole space spills out seamlessly to the north-facing deck and established, low-maintenance garden. With a distinctly tropical vibe, this is the dream private entertainer’s zone. Young families will appreciate the flat lawn, ideal for kicking a ball and building memories.\n\nFlexible, comfortable living spaces include a second lounge for quiet movie nights together, while the plush master bedroom provides a private retreat with beautifully tiled ensuite and a walk-in-robe. Three further bedrooms all come with built-in wardrobes, serviced by a striking family bathroom.\n\nPerfectly positioned on 558sqm and move-in ready, this magical family home also benefits from a heat pump, secure double garage plus ample off-street parking for five cars. Enjoying easy access to schools including Mt Eden Primary, parks, shops and the vibrant cafe culture of Mt Eden Village, and with Eden Park and the city nearby, lifestyle and convenience are assured. Don’t delay viewing this serene sanctuary. ~#~ Stunning Mt Eden Villa in DGZ ~#~ Bellevue Road Mt Eden  Auckland City  Garage Garaging  Double Garaging  Off Street Parking Garaging  Weatherboard Exterior  Combined Lounge Dining  Combined Kitchen Dining  Modern Kitchen  Ensuite Bathrooms  Com. Bath/WCs Bathrooms  Wooden Joinery  Local Views  Private Views  Level Section Con  Color Steel Roof  Decking Features  Polished Floors Features  Walk-in Wardrobe Features  Other Features Features  Wooden Base  Fully Fenced Fencing  Family Rooms  Separate Lounge Rooms  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T01:00:00+00:00",
      "overlay": "AUCTION TOMORROW",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 558,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T03:00:00+00:00",
      "auctionLocation": "Mt Eden Branch",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-20T20:10:44+00:00"
    },
    {
      "listingNumber": 900876,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.896286,
      "geoLong": 174.75604,
      "geoCodeWgs": "POINT (174.75604248046875 -36.896289825439453)",
      "street": "11C Shackleton Road",
      "streetNumber": "11C",
      "streetOnly": "Shackleton Road",
      "suburb": "Mt Eden",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7memk.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mknr.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7memj.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mkns.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7memm.jpg"
      ],
      "imageCount": 19,
      "video": "www.youtube.com/embed/Hl8Q_h__f-E?rel=0",
      "price": "For Sale by Tender",
      "settlementDate": "2024-11-28T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "Contemporary Perfection in Mt Eden",
      "adSummary": "Get ready to fall in love with this stunning, brand new family home, offering breathtaking views throughout.\n\nThe expansive open-plan living, kitchen, and dining area is complemented by standout features like a butler’s pantry, an additional separate living room, study nooks, and a versatile children's play space or extra storage option.\n\nThe master suite is a true retreat, with sweeping views of Big King Reserve, a spacious walk-in robe, and a beautifully bright and elegant ensuite.\n\nThere's no shortage of accommodation, with three additional bedrooms all serviced by a luxurious main bathroom, featuring top-quality fixtures and fittings.\n\nEngineered timber flooring offers easy maintenance in this highly desirable location.\n\nWith a double garage, internal access, and your own freehold title, this home is designed for convenience.\n\nLocated in the coveted Mangawhau and MAGS school zones, this property ensures a bright future for your growing family.\n\nBe the very first to live in this exceptional home. Visit the open homes or call to schedule a private viewing. ~#~ Contemporary Perfection in Mt Eden ~#~ Shackleton Road Mt Eden  Auckland City  Garage Garaging  Double Garaging  Weatherboard Exterior  Combined Kitchen Dining  Designer Kitchen  Butlers Pantry Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  View Other Views  Longrun Roof  Other Features Features  Concrete Base  Family Rooms  Separate Lounge Rooms  Heat Pump Heating  Heating Other Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-08T22:00:00+00:00",
      "overlay": "TENDER CLOSES THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 321,
      "pendingLiveDate": "2024-10-16T11:00:00+00:00",
      "tenderDateTime": "2024-11-07T02:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T20:30:14+00:00"
    },
    {
      "listingNumber": 900819,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.92206,
      "geoLong": 174.67896,
      "geoCodeWgs": "POINT (174.678955078125 -36.92205810546875)",
      "street": "88 Willerton Avenue",
      "streetNumber": "88",
      "streetOnly": "Willerton Avenue",
      "suburb": "New Lynn",
      "region": "Waitakere City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mtny.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mtp2.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mtp5.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mtp3.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mtp6.jpg"
      ],
      "imageCount": 27,
      "video": "www.youtube.com/embed/MeKaEZRaGrc?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-17T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "LOCATION, SPACE & TRANQUILITY!",
      "adSummary": "Welcome to this fantastic family retreat, nestled at the end of a quiet cul-de-sac with a serene bush backdrop, offering the perfect escape from the hustle and bustle. There's even a secret garden which was the deciding factor in the current owner's purchase of this property 10 years ago!\n\nThis spacious 4-bedroom, 2-bathroom (150m2 floor area approx) home is spread across two levels, providing a versatile layout ideal for growing or extended families. \n\nThe polished timber floors add warmth and character, while the modern kitchen makes meal prep a breeze. Relax on the sun-drenched deck for your morning coffees or a wine or two with friends. The rumpus room is perfect for a gym, home office, or extra storage. There's space for everyone to live, work and relax in comfort.\n\nSet in the sought-after New Lynn Heights, this home is just an 800-meter stroll to Arahoe Primary School, with zoning for Green Bay High. You’ll be only a 5-minute drive from the vibrant LynnMall shopping precinct, filled with restaurants, shops, and the convenience of the nearby train station—everything you need is within reach!\n\nThe current owners have already found their next dream home and are highly motivated to sell! Please ignore CV!\n\nReady to make this beautiful home yours? Contact me today to arrange a viewing and start imagining the next chapter of your life at 88 Willerton Ave.\n\nBuilding report, LIM report, and property file are available for your peace of mind. Pre-auction offers are welcomed—don’t miss out on this fantastic opportunity! ~#~ LOCATION, SPACE & TRANQUILITY! ~#~ Willerton Avenue New Lynn  Waitakere City  Double Carport Garaging  Carport Garaging  Weatherboard Exterior  Fibrolite Exterior  Open Plan Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Wooden Joinery  Bush Views  Local Views  Mixed Section Con  Iron Roof  Decramastic Roof  Decking Features  Pantry Features  Polished Floors Features  Fibrolite Base  Concrete Base  Partially Fenced Fencing  Separate Laundry Rooms  Rumpus Rooms  Heat Pump Heating  Ventilation System Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Burglar Alarm ...",
      "overlay": "AUCTION THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1126,
      "pendingLiveDate": "2024-10-23T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-23T13:30:56+00:00"
    },
    {
      "listingNumber": 899676,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.880337,
      "geoLong": 174.78975,
      "geoCodeWgs": "POINT (174.78976440429688 -36.880336761474609)",
      "street": "3 Dromorne Road",
      "streetNumber": "3",
      "streetOnly": "Dromorne Road",
      "suburb": "Remuera",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7kte3.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ktes.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ktec.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kted.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kte6.jpg"
      ],
      "imageCount": 28,
      "video": "www.youtube.com/embed/xQDU1mdpu5E?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-04T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 3,
      "parkingCount": 5,
      "adHeadline": "DGZ Remuera Lifestyle for all Ages",
      "adSummary": "When the present owners commissioned architect Graham Pitts to design them a stylish central Remuera home, the priority was for multifunctionality that would provide long-term, easy living for 2, but that would also accommodate large family gatherings and plenty of guests.\n\nThis is exactly what 3 Dromorne Rd delivers - several living spaces, 4/5 bedrooms (including one on ground level), 3 bathrooms, open plan living, and indoor/outdoor flow to an easy-care north-facing garden.\n\nBut this is about so much more than functionality – the twin vaulted ceilings instil a sense of space and style, the clever use of natural timbers to add warmth, the huge windows casting light onto the beautiful wooden staircase, all remind you that this is an enduring architectural home.\n\nThese are the reasons why the present owners never considered moving on for over 20 years. But circumstances have recently changed, giving new owners the opportunity to buy into the incredibly convenient and tightly held Dromorne Rd. \n\n\"Here, in the heart of DGZ, you’re next door to the Remuera Bowling Club (potentially also the new home of Auckland Bridge Club). You’re moments from Remuera Village, the supermarket, Kings School and Remuera Primary.  You’re just 500m from the train station and motorway, and you can walk via Mount Hobson to Newmarket.\"\n\nWith all these amenities, schools and transport links so close, this home will appeal to a wide range of buyers, be it a family, professionals, down-sizers, or those looking for multigenerational living. \n\nWe recommend early viewing and look forward to welcoming you at an Open Home. ~#~ DGZ Remuera Lifestyle for all Ages ~#~ Dromorne Road Remuera  Auckland City  Garage Garaging  Internal Access Garaging  Double Garaging  Off Street Parking Garaging  Plaster Exterior  Open Plan Dining  Combined Lounge Dining  Modern Kitchen  Ensuite Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Local Views  Level Section Con  Concrete Tile Roof  Pantry Features  Polished Floors Features  Walk-in Wardrobe Features  GAS Fire Features  Block Base  Fully Fenced Fencing  Family Rooms  Separate Laundry Rooms  Separate Lounge Rooms  Open Fire Heating  Gas Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Refrigerator Chattels  Central Vac System Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-05T01:45:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 552,
      "pendingLiveDate": "2024-10-14T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T13:30:43+00:00"
    },
    {
      "listingNumber": 900235,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.86707,
      "geoLong": 174.79881,
      "geoCodeWgs": "POINT (174.79881286621094 -36.867073059082031)",
      "street": "246A Victoria Avenue",
      "streetNumber": "246A",
      "streetOnly": "Victoria Avenue",
      "suburb": "Remuera",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m20w.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m34h.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m2xg.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m1hk.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m1ht.jpg"
      ],
      "imageCount": 33,
      "video": "www.youtube.com/embed/ShJ9Y9r6cW4?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-28T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 3,
      "parkingCount": 3,
      "adHeadline": " Exquisite New Luxury Awaits",
      "adSummary": "This architecturally designed home is the perfect blend of contemporary luxury and timeless elegance. Located in a prestigious avenue in the double Grammar zone, neighbouring popular Victoria Ave Primary School and close to elite private schools, St Kentigern’s, Kings and Baradene, this brand-new home is also handy to scenic Orakei Basin and Hobson Bay walkways.\n \nYou will love the breathtaking open plan living and dining with high stud and bathed in all day sunshine. The seamless indoor-outdoor flow leads to a private, north-facing deck and garden, providing a safe haven for children and pets to play. At the heart, you will discover a designer kitchen with premium appliances and a scullery.\nWhether you’re hosting intimate gatherings or grand soirées, this kitchen is designed to cater to all your needs. The media room offers versatility, whether you desire a home office, private theatre, or a second living area. Upstairs, you’ll discover four spacious double bedrooms, including two with ensuites. \n\nYou will love the bonus of double internal access garaging and even room for a boat. Enjoy the luxury of moving straight into this brand-new home, specifically designed for modern family living. Our vendor is motivated to sell and committed to meeting the market so don’t miss this rare opportunity.\n\nContact us today to arrange your private viewing and secure this stunning property before it’s too late. ~#~  Exquisite New Luxury Awaits ~#~ Victoria Avenue Remuera  Auckland City  Garage Garaging  Double Garaging  Off Street Parking Garaging  Exterior Other Exterior  Open Plan Dining  Combined Lounge Dining  Combined Kitchen Dining  Gas (Reticulated) Kitchen  GAS CookTop Kitchen  Modern Kitchen  Ensuite Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Level Section Con  Longrun Roof  Decking Features  Walk-in Wardrobe Features  Partially Fenced Fencing  Family Rooms  Separate Lounge Rooms  Dining Room Rooms  Central Heating Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-08T23:45:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 367,
      "pendingLiveDate": "2024-10-08T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T04:30:00+00:00",
      "auctionLocation": "Epsom Branch",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-08T13:39:59+00:00"
    },
    {
      "listingNumber": 900550,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.8671,
      "geoLong": 174.84941,
      "geoCodeWgs": "POINT (174.84942626953125 -36.867099761962891)",
      "street": "309 St Heliers Bay Road",
      "streetNumber": "309",
      "streetOnly": "St Heliers Bay Road",
      "suburb": "St Heliers",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m3pk.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m3pm.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m3pn.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m3pp.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m3pq.jpg"
      ],
      "imageCount": 39,
      "video": "www.youtube.com/embed/3BXjN8GITsI?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-04T11:00:00+00:00",
      "bedroomCount": 6,
      "bathroomCount": 4,
      "parkingCount": 4,
      "adHeadline": "Home and Income on 835m2 of Prime Land!",
      "adSummary": "Look what we found here! A two-income property in a prime St Heliers location with so many options. The choice is yours. \n\nOption 1: Even though the property may be a bit tired, it is very livable as is and you could live in either the spacious 4-bedroom 3-bathroom main family home or the sun splashed 2 bedroom second dwelling and enjoy receiving a substantial weekly rental – handy to pay off your mortgage quicker!\n\nOption 2: If you are keen to roll up your sleeves then with a few weeks’ hard work on the house and second dwelling, a few weekends in the garden and a few friends to help, you can create a home with an income that truly celebrates the classic Eastern Bays lifestyle in an enviable location.\n\nOption 3: For those with a penchant for a profit, you can demolish and start with a blank canvass of 835m2 of mixed housing urban zoned land in a prime St Heliers location. Based on the planned 11-unit upmarket development on the adjoining site, as well as some of the already successfully completed new homes close by, we think this should be your next successful development project. Just look at what you are getting: a flat rectangular North facing site with on-site storm & wastewater manholes already installed in a prime location with a $1500 per week income during your planning and application period - Doesn’t really get any better!\n\nOption 4: Purchase and add to your investment portfolio as an investment property with two incomes and an angle for future owners to develop. Apart from the good return, most investors would factor in the substantial capital gain properties of this caliber deliver.\n\nZone for Top Schools Selwyn College and St Thomas School. \n\nWhether you choose to simply move in, renovate and create your dream home with additional income, explore development opportunities or are simply seeking a great investment opportunity, this property offers endless possibilities. Contact me today to know more and schedule a private viewing at your convenience. Good luck! ~#~ Home and Income on 835m2 of Prime Land! ~#~ St Heliers Bay Road St Heliers  Auckland City  Carport Garaging  Weatherboard Exterior  Combined Lounge Dining  Standard Kitchen  Ensuite Bathrooms  Com. Bath/WCs Bathrooms  Mixed Joinery  Wooden Joinery  Local Views  Wide Views  Sea Views  Mixed Section Con  Iron Roof  Decking Features  Partially Fenced Fencing  Family Rooms  Dining Room Rooms  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Rangehood Chattels  Dishwasher Chattels  Stove ...",
      "nextOpenHome": "2024-11-09T00:30:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 835,
      "pendingLiveDate": "2024-10-16T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T22:12:06+00:00"
    },
    {
      "listingNumber": 900602,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.87675,
      "geoLong": 174.83588,
      "geoCodeWgs": "POINT (174.83589172363281 -36.876754760742188)",
      "street": "6 Allen Johnston Place",
      "streetNumber": "6",
      "streetOnly": "Allen Johnston Place",
      "suburb": "St Johns",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m49v.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mb09.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m49m.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m49w.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m49y.jpg"
      ],
      "imageCount": 16,
      "video": "www.youtube.com/embed/-_0D6ZVdNoI?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 6,
      "adHeadline": "Quality Build with Cavity + Golf Enthusiasts Dream",
      "adSummary": "Looking for an exclusive lifestyle in a lauded location? This elegantly bold Shanahan designed executive home is sure to impress! The quality and thoughtfulness of design is apparent from the very first instance and offers you and yours the most beautiful entertainers home. Downstairs living is orientated to enhance the country feel as you enjoy uninterrupted views across Remuera golf course, whilst the upstairs you will find generous areas for study, afternoon GNT's and all out relaxing! You have just discovered that elusive 'hole in one...it's time to celebrate!\n\n• 3 double bedrooms, 2.5 bathrooms\n• Triple internal access garaging + workshop space\n• Architecturally designed and built with a cavity\n• 818m2 of North facing land; 297m2 of exclusive living. ~#~ Quality Build with Cavity + Golf Enthusiasts Dream ~#~ Allen Johnston Place St Johns  Auckland City  Garage Garaging  Internal Access Garaging  Off Street Parking Garaging  More than two Garaging  Plaster Exterior  Exterior Other Exterior  Separate Dining  Gas (Reticulated) Kitchen  Designer Kitchen  GAS CookTop Kitchen  Butlers Pantry Kitchen  Ensuite Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  View Other Views  Mixed Section Con  Longrun Roof  Butynol Roof  Decking Features  Pantry Features  Walk-in Wardrobe Features  Concrete Base  Partially Fenced Fencing  Family Rooms  Separate Laundry Rooms  Separate Lounge Rooms  Office/Study Rooms  Dining Room Rooms  Workshop Rooms  Rooms Other Rooms  Heat Pump Heating  Heating Other Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Refrigerator Chattels  Central Vac System Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 818,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:30:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-15T13:32:03+00:00"
    },
    {
      "listingNumber": 900024,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.903378,
      "geoLong": 174.77675,
      "geoCodeWgs": "POINT (174.77674865722656 -36.903377532958984)",
      "street": "14 Lewin Road",
      "streetNumber": "14",
      "streetOnly": "Lewin Road",
      "suburb": "Epsom",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mbs3.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mbn6.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mbnh.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mbnj.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mbnk.jpg"
      ],
      "imageCount": 24,
      "video": "www.youtube.com/embed/-wKIuDE-bIY?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-15T11:00:00+00:00",
      "bedroomCount": 5,
      "bathroomCount": 3,
      "parkingCount": 4,
      "adHeadline": "LAST WEEKEND TO VIEW BEFORE AUCTION!",
      "adSummary": "Perched in a supreme position on one of Epsom's most desirable leafy streets bordering the iconic Cornwall Park, this stunning 1920s Californian bungalow is the parkside family lifestyle dream. With breathtaking elevated views over the neighbourhood, you’ll nearly feel amongst the clouds - like you're \"walking on sunshine\" every day!\n\nThe enviable street appeal and character features will capture your heart (including exquisite garden landscaping, polished hard wood floors, leadlights and bay windows), whilst the family-sized comfort and indoor/outdoor space will tick the boxes for lifestyle practicalities. The star of the show is the truly gorgeous vista from the huge windows in the open-plan dining and kitchen space. This is the perfect scenic backdrop for your special moments with family and friends; from lively dinner parties and lazy long lunches, to peaceful sunrise coffees and relaxing sunset vinos. \nYou'll entertain with absolute style and ease, thanks to the smartly configured designer kitchen which strikes the perfect balance of sleek and sophisticated yet full of warmth and real heart. Extend the good times outside with the rear patio and deck, well-positioned for all-day and late afternoon sun.Further inside the main house are four spacious bedrooms, two bathrooms plus additional room downstairs, ideal as a home office, media or rumpus room. But wait… there's more! The cherry on the top is the separate self- contained studio at the back, with external access, bathroom and kitchenette - perfect for the independent teen or older family member, or guest accommodation.\n\nThe location is simply unbeatable - you're keeping good company amongst some of Epsom's finest homes, with the amazing park domain within arm's reach. The best of Auckland is right here on your doorstep: incredible summit views and endless park walking trails, delicious neighbourhood eateries and fantastic local shops plus excellent schools - all easily reached on foot. \n\nAfter nearly 25 years, this home awaits new memories to be made! ~#~ LAST WEEKEND TO VIEW BEFORE AUCTION! ~#~ Lewin Road Epsom  Auckland City  Off Street Parking Garaging  Single Carport Garaging  Carport Garaging  Weatherboard Exterior  Open Plan Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Wooden Joinery  Rural Views  Sloping Section Con  Color Steel Roof  Decking Features  Polished Floors Features  Wooden Base  Fully Fenced Fencing  Family Rooms  Separate Laundry Rooms  Sleepout Rooms  Separate Lounge Rooms  Heat Pump Heating  Ventilation System Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Refrigerator Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 971,
      "pendingLiveDate": "2024-10-16T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:30:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T20:23:06+00:00"
    },
    {
      "listingNumber": 901008,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.923115,
      "geoLong": 174.75458,
      "geoCodeWgs": "POINT (174.75457763671875 -36.923118591308594)",
      "street": "2/208 Hillsborough Road",
      "streetNumber": "2/208",
      "streetOnly": "Hillsborough Road",
      "suburb": "Hillsborough",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mj83.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mj8a.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mj81.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mj88.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mj89.jpg"
      ],
      "imageCount": 20,
      "video": "www.youtube.com/embed/8qVjHlg-5pg?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-12T11:00:00+00:00",
      "bedroomCount": 2,
      "bathroomCount": 2,
      "parkingCount": 1,
      "adHeadline": "Urgent Notice for the Pre Auction... ",
      "adSummary": "Now selling on Wednesday 6th November at 1.30pm. This is the last chance to purchase this home as a buyer has made a pre-auction offer and the auction has been brought forward, the opening bid will be the reserve and it will be on the market to sell.  It is being held at Barfoot & Thompson, 34 Shortland Street, Auckland City and Online via App (prior registration required for online bidding). Please contact the listing salesperson if you have an interest.\n\nDiscover this fabulous home, perfectly nestled in a peaceful, green setting. With an expansive floor area and  extra-large lounge, this property offers generous, open-plan living designed for comfort and relaxation.\n\nThe wrap-around deck provides ample outdoor space to soak up the sun all day, while enjoying the serene surroundings of trees and lush greenery. The home is filled with natural light, thanks to the abundance of windows that showcase the beautiful outlook.\n\nBoth bedrooms are spacious doubles, with the master featuring an ensuite for added convenience. There’s also internal access to the garage, which includes extra space perfect for a workshop or additional storage.\n\nLocated just minutes from the motorway, this home offers an easy commute to the airport and a range of shopping options nearby, including Stoddard Road, Onehunga, and Royal Oak. Plus, you’ll find a great selection of local cafés just a short distance away.\n\nAfter 30+ years of enjoying this private, green retreat with wonderful neighbours, our lovely owner is ready to pass it on to you. If you are looking to downsize without compromising on living space or are wanting a home ready to move into with the opportunity to add your own touches this is a must view. \nDon’t miss your chance to call this central oasis home. We look forward to seeing you at the open homes! ~#~ Urgent Notice for the Pre Auction...  ~#~ Hillsborough Road Hillsborough  Auckland City  Garage Garaging  Single Garaging  Brick Exterior  Open Plan Dining  Modern Kitchen  Ensuite Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Wide Views  Mixed Section Con  Concrete Tile Roof  Decking Features  Pantry Features  Block Base  Separate Laundry Rooms  Basement Rooms  Kent Style Fire Heating  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Heated Towel Rail Chattels  Garage Door Opener Chattels  Stove Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1470,
      "pendingLiveDate": "2024-10-21T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:30:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-21T13:31:45+00:00"
    },
    {
      "listingNumber": 900026,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Lifestyle",
      "geoLat": -37.19727,
      "geoLong": 174.75069,
      "geoCodeWgs": "POINT (174.75068664550781 -37.197273254394531)",
      "street": "64 Brookside Road",
      "streetNumber": "64",
      "streetOnly": "Brookside Road",
      "suburb": "Glenbrook",
      "region": "Franklin District",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mfhr.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mfhp.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mfhn.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mfq6.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mayw.jpg"
      ],
      "imageCount": 21,
      "video": "www.youtube.com/embed/VuP-il5Czr4?rel=0",
      "price": "For Sale by Tender",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 5,
      "adHeadline": "\"TIME TO MOVE ON\" - PRIME ELEVATED 12.42Ha",
      "adSummary": "Nestled on approximately 12.42 hectares of prime land, this exceptional property offers the perfect blend of countryside tranquillity and stunning panoramic views. The elevated home, completed in 2007, boasts breathtaking rural vistas toward the Manukau Harbour, Auckland City, and has a serene back drop over the neighbouring pond.\n\nA spacious patio wraps around the home, providing the ideal space to relax and take in the stunning surroundings! This property offers the perfect rural lifestyle, with ample space for farming, relaxation, or creating your dream retreat, featuring a 10 x 9 shed for toys and machinery.\n\nA substantial set up like this doesn’t come up very often! Make enquiry today to turn your dream into reality!\n\n• Large Land Holding of 12.42 ha (approx.)\n• Zoned: Rural - Mixed Rural Zone\n• Elevated Home With Captivating Views\n• Modern Design, Completed in 2007\n• Covered Patio Area For Outdoor Living & Entertaining\n• Stock Yards Included\n• Generous Shed For Storage Or Hobbies\n• Peaceful Rural Setting With Amenities Nearby\n• In Zone For Local Schools\n• 10mins Waiuku, 20mins Pukekohe & 20mins SH1 (Approx.)\n\nFor the purpose of this transaction the vendor is GST Registered and the Purchase Price Plus GST (if any)\n\n64 and 66 Brookside Road are selling via Tender on the same day. Tender Closing – 7 th November 2024 (unless sold prior) - Buy one or both, the choice is yours! ~#~ \"TIME TO MOVE ON\" - PRIME ELEVATED 12.42Ha ~#~ Brookside Road Glenbrook  Franklin District  Garage Garaging  Internal Access Garaging  More than two Garaging  Brick Exterior  Open Plan Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  City Views  Wide Views  Sea Views  Rural Views  Level Section Con  Concrete Tile Roof  Walk-in Wardrobe Features  Gentle Contour  Steep Contour  Concrete Base  Partially Fenced Fencing  Grazing Use  Lifestyle Use  Separate Lounge Rooms  Office/Study Rooms  Electric Fence Unit Land Chattels  Existing Water Pipes Land Chattels  Land Chattels Pumps Land Chattels  No. of Paddocks Land  Yards Land  Rural Feature Rural  Rural Water House Rural  Rural Water Tank Rural  Kent Style Fire Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Other Chattels Chattels  Septic Sewage  Other ...",
      "overlay": "TENDER CLOSES THURSDAY",
      "isGSTInclusive": true,
      "landUse": [
        "Grazing",
        "Lifestyle"
      ],
      "floorArea": 0,
      "landArea": 124259,
      "pendingLiveDate": "2024-10-02T11:00:00+00:00",
      "tenderDateTime": "2024-11-07T02:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-03T03:06:17+00:00"
    },
    {
      "listingNumber": 900062,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Unit",
      "geoLat": -36.86784,
      "geoLong": 174.84451,
      "geoCodeWgs": "POINT (174.84452819824219 -36.867839813232422)",
      "street": "2/329  Kohimarama Road",
      "streetNumber": "2/329",
      "streetOnly": "Kohimarama Road",
      "suburb": "St Heliers",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7np3b.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mfwx.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mg6h.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mfww.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mfwz.jpg"
      ],
      "imageCount": 20,
      "video": "www.youtube.com/embed/PkxCbcNOtNQ?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-21T11:00:00+00:00",
      "bedroomCount": 2,
      "bathroomCount": 1,
      "parkingCount": 2,
      "adHeadline": "Affordable Kohi Unit – Urgent Sale!",
      "adSummary": "Short Notice Auction!\n\nThis is your chance to secure a solid, stylish 2-bedroom brick and tile unit in the heart of St Heliers. Nestled down a private driveway, this well-maintained home offers a perfect blend of comfort, convenience, and charm. With the vendor moving overseas, this property must be sold!\n\nKey Features:\n\n• 2 Spacious Bedrooms: Ideal for comfortable living or potential rental.\n\n• Modernised Kitchen & Bathroom: Ready for easy day-to-day living with contemporary finishes.\n\n• Private Outdoor Space: Perfect for enjoying sunny afternoons and quiet relaxation.\n\n• Generous Single Garage: Ample storage, workshop space, and an additional off-street parking spot.\n\n• Healthy Homes Standards Compliant: Fully compliant, making it a hassle-free, attractive investment for landlords.\n\n• Elevated Views: Overlooks the scenic pony club fields, with glimpses of One Tree Hill and the CBD.\n \nSituated on key bus routes and next to the Glen Innes to Tamaki Drive Shared Path, this prime location is just minutes from stunning Eastern Bays beaches, vibrant cafes, and Eastridge Shopping Centre. Zoned for the highly sought-after St Thomas's School and Selwyn College, this unit is perfect for families, downsizers, or investors.\n\nDon’t miss out on this incredible opportunity in the heart of St Heliers – this property won’t last long!\n\n ~#~ Affordable Kohi Unit – Urgent Sale! ~#~ Kohimarama Road St Heliers  Auckland City  Garage Garaging  Single Garaging  Off Street Parking Garaging  Brick Exterior  Open Plan Dining  Modern Kitchen  Com. Bath/WCs Bathrooms  Mixed Joinery  Local Views  Urban Views  Park Views  Concrete Tile Roof  Block Base  Partially Fenced Fencing  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Garden Shed Chattels  Rangehood Chattels  Waste Disposal Unit ...",
      "nextOpenHome": "2024-11-08T23:30:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1265,
      "pendingLiveDate": "2024-10-21T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T04:30:00+00:00",
      "auctionLocation": "Epsom Branch",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-21T13:30:45+00:00"
    },
    {
      "listingNumber": 900889,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.918762,
      "geoLong": 174.92021,
      "geoCodeWgs": "POINT (174.92021179199219 -36.91876220703125)",
      "street": "22 Orohena Close",
      "streetNumber": "22",
      "streetOnly": "Orohena Close",
      "suburb": "Northpark",
      "region": "Manukau City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mjj8.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mjj4.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mjjb.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mjj3.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mjja.jpg"
      ],
      "imageCount": 19,
      "video": "www.youtube.com/embed/bXBmtlGtbhA?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-11T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "SOLID RENDERED BLOCK - POINT VIEW SCHOOL ZONED!",
      "adSummary": "This solid rendered block, super spacious family home exudes comfort & functionality & offers a convenient location coupled with a host of additional features & benefits.\n\nCatering excellently to the dynamic needs of a busy family lifestyle, the home boasts two separate living areas each presenting superb indoor/outdoor connectivity. The inviting formal lounge is generously proportioned & the family room is a true standout with its high stud ceilings, abundant natural light & open plan configuration with the modern tiled kitchen. Here the chef of the family will delight in the contemporary stone benchtop, tiled splashback, plentiful storage, & a useful breakfast bar.\n\nThe downstairs master bedroom incorporates the convenience of a walk-in wardrobe & ensuite bathroom, while bedrooms 2,3 & 4 are serviced by the tiled family bathroom. There’s sure to be a scramble to secure bedroom 4, with its simply massive floor area including scope to incorporate a work-from-home aspect too.                                                                                                                                                                                                                                                                                                                                                                 \n\nA fenced, level, & private Freehold section, complemented by a covered patio seating area guarantees effortless entertaining. Merits include 2x heat pumps, 2x powder rooms, a double internal access garage, a garden shed, ample off-street parking - plus more.\n\nPoint View School, Somerville Intermediate School & Botany Downs School zoned & close by to all one needs for easy care living. \n\n ~#~ SOLID RENDERED BLOCK - POINT VIEW SCHOOL ZONED! ~#~ Orohena Close Northpark  Manukau City  Garage Garaging  Double Garaging  Masonry Block/Brick Exterior  Open Plan Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Local Views  Level Section Con  Color Steel Roof  Walk-in Wardrobe Features  Concrete Base  Separate Lounge Rooms  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "AUCTION TOMORROW",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 647,
      "pendingLiveDate": "2024-10-16T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T00:00:00+00:00",
      "auctionLocation": "Highbrook Drive",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T19:50:52+00:00"
    },
    {
      "listingNumber": 898718,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.905247,
      "geoLong": 174.77405,
      "geoCodeWgs": "POINT (174.77406311035156 -36.905250549316406)",
      "street": "3 Goodland Street",
      "streetNumber": "3",
      "streetOnly": "Goodland Street",
      "suburb": "Royal Oak",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m95b.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m94j.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m94t.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m94v.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m94w.jpg"
      ],
      "imageCount": 27,
      "video": "www.youtube.com/embed/Ev_Cmk9tY34?rel=0",
      "price": "For Sale by Tender",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 4,
      "adHeadline": "LAST WEEKEND TO VIEW BEFORE TENDER DATE!",
      "adSummary": "The perfect blend of space, size and dreamy lifestyle location, this light-filled family home (plaster clad) is literally a hop, skip and jump away from the iconic Cornwall Park and hits all the right notes for fantastic family living in central Auckland.\n\nFrom delicious eateries and fantastic local shops, to excellent schools and loads of green space, walking tracks and unbeatable summit views, the best of Auckland is right here on your doorstep!\n\nLocated in a quiet cul-de-sac and set over two levels with generous floor space, there’s more than enough room for the whole family to spread out and enjoy. Living spaces feature on the lower level, with an open-plan kitchen, dining and sitting area. Bi-fold doors take you through to the patio and rear garden – a great way to extend the good times during the warmer seasons. The formal lounge is perfect for family movie nights or quieter moments, plus a separate study/office is well-positioned to keep the focus.\n\nUpstairs are the double bedroom retreats and bathrooms, with the master suite including ensuite and walk-in robe. Light streams in from everywhere, creating a home that feels light, bright and airy in every corner. Perfectly liveable as it is, there’s huge opportunity to refresh and update as you like.\n\nThe location is an absolute cracker - magical Cornwall Park, Greenwoods Corner and Royal Oak shops are within easy walking distance, and commuter connections are an absolute breeze being just off the main road.\n\nWith a huge double garage and additional off-street parking, this is easy, breezy family living! ~#~ LAST WEEKEND TO VIEW BEFORE TENDER DATE! ~#~ Goodland Street Royal Oak  Auckland City  Garage Garaging  Internal Access Garaging  Double Garaging  Off Street Parking Garaging  Roughcast Exterior  Open Plan Dining  Gas (Reticulated) Kitchen  GAS CookTop Kitchen  Standard Kitchen  Ensuite Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Wide Views  Level Section Con  Metal Tile Roof  Walk-in Wardrobe Features  Concrete Base  Partially Fenced Fencing  Family Rooms  Separate Lounge Rooms  Office/Study Rooms  Rural Water Town Rural  Gas Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Central Vac System Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "TENDER CLOSES THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 400,
      "pendingLiveDate": "2024-10-16T11:00:00+00:00",
      "tenderDateTime": "2024-11-07T03:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T13:30:22+00:00"
    },
    {
      "listingNumber": 900385,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.919594,
      "geoLong": 174.72469,
      "geoCodeWgs": "POINT (174.72470092773438 -36.919597625732422)",
      "street": "79A Penney Avenue",
      "streetNumber": "79A",
      "streetOnly": "Penney Avenue",
      "suburb": "Mt Roskill",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m173.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m16p.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m177.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m16q.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m16r.jpg"
      ],
      "imageCount": 25,
      "video": "www.youtube.com/embed/WVaz1ckCyNA?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 6,
      "bathroomCount": 4,
      "parkingCount": 6,
      "adHeadline": "Gorgeous family home with space for all",
      "adSummary": "Sitting proud on the knoll, this sun-drenched impeccable 3-year old home offers contemporary living with a generous 316m² floor area (approx). There are 6 bedrooms plus 2 living areas, offering a versatile floor plan to suit all the family and every occasion. The intricate design 4+2 with check meters is perfect for a large family.\n\nNestled in an elevated right-of-way on a level 467m² site, (more or less), landscaped and fully fenced grounds to enjoy privacy, safety and tranquillity.  Whether it's a quiet evening, alfresco summer barbeques or formal entertaining, with plenty of room for children and pets, this is a great home for an easy-care family lifestyle and a great lock and leave.\n\nGround floor has a functional kitchen equipped with high-quality kitchen appliances. Additionally, a tea room/ kitchenette provides an enhanced cooking experience and added convenience for the family. An open plan kitchen to dining, then to the lounge, complemented by 2 bedrooms, a bathroom with its own access. Extended family can enjoy their own peace and quiet in this section.  The convenience of an internal access double garage, abundant off-street parking are a bonus and there is plenty of storage too.\n\nUpstairs, you’ll find a versatile family room with views, 4 generous double bedrooms, two of them are master bedrooms, each with its own ensuite bathroom, one family bathroom, and a laundry.\n\nJust a short stroll to Margaret Griffen Park, Maungakiekie Golf Club, Lynfield Youth Leisure Centre, and local schools, minutes’ drive to motorway 20 access and Lynfield shopping centre. \n\nThis home is ready and waiting for a new owner to enjoy all it has to offer. Welcome home.\n\n ~#~ Gorgeous family home with space for all ~#~ Penney Avenue Mt Roskill  Auckland City  Garage Garaging  Double Garaging  Off Street Parking Garaging  Cedar Exterior  Open Plan Dining  Designer Kitchen  Ensuite Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Wide Views  Sloping Section Con  Concrete Tile Roof  Pantry Features  Polished Floors Features  Walk-in Wardrobe Features  GAS Fire Features  Wooden Base  Fully Fenced Fencing  Separate Laundry Rooms  Separate Lounge Rooms  Dining Room Rooms  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 465,
      "pendingLiveDate": "2024-10-14T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:30:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T13:30:54+00:00"
    },
    {
      "listingNumber": 900551,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Lifestyle",
      "geoLat": -37.20105,
      "geoLong": 174.7477,
      "geoCodeWgs": "POINT (174.74769592285156 -37.201053619384766)",
      "street": "66 Brookside Road",
      "streetNumber": "66",
      "streetOnly": "Brookside Road",
      "suburb": "Glenbrook",
      "region": "Franklin District",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mfj8.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mfj6.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mev2.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mev3.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mfj7.jpg"
      ],
      "imageCount": 23,
      "video": "www.youtube.com/embed/0TVOkje5Ogo?rel=0",
      "price": "For Sale by Tender",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 8,
      "adHeadline": "BRING THE TOYS - SHEDDING + YARD SPACE",
      "adSummary": "Welcome to your slice of rural paradise! Nestled on approximately 4.87 hectares of sprawling land, this 2012-built home offers the tranquillity and space that you have been searching for. Located off a private driveway, and positioned to take in sweeping rural views, this property combines modern comforts with the charm of country living!\n\nThe property boasts a spacious yard area, ample 150m2 (approx.) high stud shed, featuring a utility room with additional amenities. This residence caters perfectly for storing of large vehicles and your workshop needs! The additional 3-bay shed offers that extra space, whether it's for hobbies, farming equipment, or the potential of running a business. This property is perfect for those looking to expand their operations in a fantastic location!\n\nWith all of this on offer, and the breathtaking countryside as your backdrop, this is an\nopportunity not to be missed! Make contact today to arrange your viewing!\n\n• 3 Bedroom + 1 Study - Modern Home \n• 2 bathrooms including ensuite\n• indoor/outdoor flow, alfresco dining, decking\n• 150m2 (Approx) High Stud Shed – 3 Phase Power\n• Utility Room with Amenities In Shed\n• Additional 3 Bay Shedding\n• Ample Yard Space For Vehicles\n• Water Bore located On Property\n• Local Schools Nearby\n• Approx. 9 mins to Waiuku Shops\n\nThe vendor is registered for GST\n\n64 and 66 Brookside Road are selling via Tender on the same day. Tender Closing 3:00pm on 7 th November 2024 (unless sold prior) - Buy one or both, the choice is yours! ~#~ BRING THE TOYS - SHEDDING + YARD SPACE ~#~ Brookside Road Glenbrook  Franklin District  Garage Garaging  More than two Garaging  Exterior Other Exterior  Open Plan Dining  Modern Kitchen  Ensuite Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Rural Views  Level Section Con  Color Steel Roof  Decking Features  Walk-in Wardrobe Features  Gentle Contour  Pole Base  Partially Fenced Fencing  Grazing Use  Lifestyle Use  Separate Laundry Rooms  Sleepout Rooms  Office/Study Rooms  Deep Well Bore Land Chattels  Electric Fence Unit Land Chattels  Existing Water Pipes Land Chattels  Land Chattels Pumps Land Chattels  No. of Paddocks Land  Rural Feature Rural  Rural Feature Rural  Rural Water House Rural  Rural Water Tank Rural  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Burglar Alarm Chattels  Other Chattels Chattels  Septic Sewage  Other ...",
      "overlay": "TENDER CLOSES THURSDAY",
      "isGSTInclusive": true,
      "landUse": [
        "Grazing",
        "Lifestyle"
      ],
      "floorArea": 0,
      "landArea": 48754,
      "pendingLiveDate": "2024-10-09T11:00:00+00:00",
      "tenderDateTime": "2024-11-07T02:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-21T21:10:57+00:00"
    },
    {
      "listingNumber": 899973,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.765026,
      "geoLong": 174.6869,
      "geoCodeWgs": "POINT (174.68690490722656 -36.7650260925293)",
      "street": "42 William Gamble Drive",
      "streetNumber": "42",
      "streetOnly": "William Gamble Drive",
      "suburb": "Greenhithe",
      "region": "North Shore City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mbaz.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mbb1.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mbaw.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mbb2.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mbb3.jpg"
      ],
      "imageCount": 21,
      "video": "www.youtube.com/embed/k68NrmfpjB8?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-19T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 4,
      "adHeadline": "Single Level Living",
      "adSummary": "Discover the epitome of charm and elegance in this immaculate family home, where a perfect blend of weatherboard and brick with Titan board construction creates an inviting facade that captivates from the curb. Just steps away from the renowned Upper Harbour Primary School!\n\nAnd only a stroll or bike ride through to Greenhithe village along the public footbath on Kyle Road, ideal weekend fun enjoying the Wainoni Pony Club and numerous parks.\n\nThis single-level gem, with attention to detail, offers the perfect blend of comfort, convenience, and contemporary design. The spacious home features four bedrooms, providing ample space for the whole family. The two well-appointed bathrooms (master with ensuite) add to the convenience with under floor heating, making busy mornings a seamless affair.\n\nThe layout is designed for modern living, with an open concept living and dining area that effortlessly flows into the well-equipped kitchen. This creates a warm and inviting space for family gatherings and entertaining guests with a second large living area.\n\nAll the modern comforts are here including a gas fire for those cosy winter nights, giving that special touch of ambiance. The property boasts a flat and generously sized section, offering a versatile space for children to play plus the added advantage of being in a safe and quiet cul de sac.\n\nThis residence isn't just a house; it's a lifestyle upgrade. Embrace the convenience of living near a top-rated primary school plus access to North Shore’s top-quality schools while enjoying the comfort of a well-designed home. Your family deserves the best, and this property delivers. Immerse yourself in the unique charm of this property and call us now to arrange a private viewing.\n ~#~ Single Level Living ~#~ William Gamble Drive Greenhithe  North Shore City  Garage Garaging  Internal Access Garaging  Double Garaging  Off Street Parking Garaging  Brick Exterior  Weatherboard Exterior  Exterior Other Exterior  Combined Lounge Dining  Designer Kitchen  GAS CookTop Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Local Views  Level Section Con  Color Steel Roof  Pantry Features  Walk-in Wardrobe Features  GAS Fire Features  Concrete Base  Fully Fenced Fencing  Separate Lounge Rooms  Dining Room Rooms  Rural Water Town Rural  Gas Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Refrigerator Chattels  Other Chattels ...",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 580,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T20:30:00+00:00",
      "auctionLocation": "The Promenade",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T00:15:18+00:00"
    },
    {
      "listingNumber": 898398,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.88884,
      "geoLong": 174.84172,
      "geoCodeWgs": "POINT (174.84173583984375 -36.888839721679688)",
      "street": "118 Stonefields Avenue",
      "streetNumber": "118",
      "streetOnly": "Stonefields Avenue",
      "suburb": "Stonefields",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7jfd5.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jfd4.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jfct.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jfca.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jfcp.jpg"
      ],
      "imageCount": 31,
      "video": "www.youtube.com/embed/qcgwKtq5yV4?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-12T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "Fabulous Flow for Family Freedom ",
      "adSummary": "An early generation Fletcher terrace home, this high quality 2011 built north facing brick residence offers a well-considered layout on a 186 sqm (approx.) floor plan. Perfect for families looking for proximity to top educational opportunities for their youngsters, this friendly and safe community is always highly sought-after for its outstanding amenities.  \n\nA pristine, contemporary interior displays elegant lighting and blond timber flooring blending harmoniously with a fresh neutral ecru and white scheme. With alfresco zones front and back accessed via two versatile ground floor living areas, summer entertaining is a given. A sleek and stylish centrally positioned kitchen is the dream gourmet hub fitted with ample cabinetry, stone benchtops and stainless-steel appliances. A guest powder room neighbours the spacious laundry beside which an extra-wide stairway ascends to upstairs accommodation. Four comfortable double bedrooms share a tiled family bathroom with skylight while the main bedroom includes similarly styled ensuite and a walk-in wardrobe. At this elevation there are pleasant views of Mt Wellington plenty of warming afternoon sun. The separate double garage accessed off the back laneway connects to the courtyard deck on a low maintenance 203 sqm (approx.) property designed to free up plenty of time for all the leisure activities minutes from your door. \n\nDucted air conditioning and heat pump ensures year-round comfort.  Walk up nearby Mt Wellington, while Stonefields wetlands are a few streets away for a nature ramble, with parks and play areas all around this community-spirited suburb. Walk to Stonefields School and handy too for Stonefields Market, Stoneridge, Lunn Avenue, and New World with public transport close and motorways also for a swift city commute. Handy for bay beaches and Remuera Golf Club, it's easy to see how this appealing home is the perfect fit for active people. ~#~ Fabulous Flow for Family Freedom  ~#~ Stonefields Avenue Stonefields  Auckland City  Garage Garaging  Double Garaging  Brick Exterior  Open Plan Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Local Views  Level Section Con  Color Steel Roof  Decking Features  Walk-in Wardrobe Features  Concrete Base  Fully Fenced Fencing  Family Rooms  Separate Laundry Rooms  Dining Room Rooms  Rural Feature Rural  Heat Pump Heating  Air-conditioning Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit ...",
      "nextOpenHome": "2024-11-09T22:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 203,
      "pendingLiveDate": "2024-10-14T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T13:30:11+00:00"
    },
    {
      "listingNumber": 900260,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Lifestyle",
      "geoLat": -37.094894,
      "geoLong": 174.98375,
      "geoCodeWgs": "POINT (174.9837646484375 -37.094898223876953)",
      "street": "38A Harry Dreadon Road",
      "streetNumber": "38A",
      "streetOnly": "Harry Dreadon Road",
      "suburb": "Drury",
      "region": "Papakura District",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m1q1.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kxzy.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kvqt.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kvnm.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kvrq.jpg"
      ],
      "imageCount": 43,
      "video": "www.youtube.com/embed/0xsJrjrIl_E?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2025-01-30T11:00:00+00:00",
      "bedroomCount": 5,
      "bathroomCount": 3,
      "parkingCount": 4,
      "adHeadline": "ELEGANCE & OPULENCE - AMAZING VIEWS - ELITE LOCALE",
      "adSummary": "Quality constructed in 2018, this luxurious 422 square metre French country style residence, located on one elevated hectare in prestigious Drury Hills features solid 19mm Rustic America oak flooring, soaring ceilings, exposed beams, chandeliers and gas fire in ground floor living.  Looking down from a mezzanine floor is a second living area while on the ground floor, double doors open into breathtaking open plan family living where the designer kitchen boasts stone benchtops, tiled splash-backs, integrated Smeg appliances, Italian tapware, island bench with breakfast bar and super-sized, well-equipped butler’s pantry.  This flows into dining and sundrenched living with gas fireplace.\n\nTwo sets of bi-fold doors  access outdoor leisure and stylish covered dining overlooking tranquil views across the flat lush lawn, landscaped gardens and out to stunning sunsets and city lights.   Proportions throughout this home are on a grand scale, including in the bedrooms where, on one side of the home an opulent master suite with ornate windows and double doors to a patio features walk-in robe, chic  double vanity ensuite, bath and separate double rain-head shower.  A large adjacent well equipped laundry opens out to a patio and the garage and there’s an office off the hallway adjoining the living zone. Above the garage, a large loft space has potential as a fifth bedroom and living to accommodate extended family.  To the opposing side, three further scenic bedrooms all have built-in robes while one has patio access plus private hallway entry to a dual entry second ensuite.  The family bathroom is ultra-attractive with Victoria and Albert limestone bath, dual Victoria and Albert vanities, rain-head shower, bespoke cabinetry plus Vado tapware.  \n\nOutdoors there are two paddocks, water tanks and filtration system, vegetable and herb gardens and space to spare.  Off the road a dual driveway meets to arrive at a turning circle and generous outdoor parking outside the two double door oversized four car garage with internal access. Outstanding from first sight and in keeping with high-calibre neighbours, this outstanding property, only minutes from the upcoming Drury town centre development, invites early inspection by the discerning buyer. \n\nElevated location in prestigious Drury Hills.  Spectacular views\nDual driveway entry to turning circle + extra off-street parking\nExcellently composed symmetrical design.  Super-sized rooms\nSolid 19mm Oak flooring\nSoaring ceilings, exposed beams & chandeliers plus gas fire \nOpen plan living.  Exceptional quality kitchen + butler’s pantry\nBifold doors in living & dining spilling out to al fresco leisure\nStylish covered dining & open recreation on long paved patio\n2nd level mezzanine living room\nLarge loft space with multiple uses - 5th bedroom or rumpus\nOffice area off hallway.  Well-equipped laundry to side patio\nLavish master bedroom, patio access, ensuite & walk-in-robe\n+ 1 bedroom with double built-in robes, dual entry ensuite & patio access\n+ 2 sunlit picturesque bedrooms, both with built-in robes \nExemplary family bathroom with bath, double vanity & shower\nInternal entry to 2 double door 4 car garage.  Extra parking\nLandscaped gardens.  Grassy areas for kids & pets to play\nVegie & herb gardens.  2 paddocks.  Rain tanks & filtration \nIn close proximity to north & south motorway access \nShort drive to Drury bus stop for Strathallan & St Ignatius\nVery handy to the new Drury town centre development and train station\nApproximately 36 kms to Auckland City & 25 kms to airport ~#~ ELEGANCE & OPULENCE - AMAZING VIEWS - ELITE LOCALE ~#~ Harry Dreadon Road Drury  Papakura District  Garage Garaging  More than two Garaging  Board/Batten Exterior  Open Plan Dining  Modern Kitchen  Butlers Pantry Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Aluminium Joinery  City Views  Wide Views  Sea Views  Rural Views  Mixed Section Con  Color Steel Roof  Walk-in Wardrobe Features  GAS Fire Features  Undulating Contour  Gentle Contour  Concrete Base  Partially Fenced Fencing  Lifestyle Use  Family Rooms  Separate Laundry Rooms  Separate Lounge Rooms  Office/Study Rooms  Dining Room Rooms  Land Chattels Pumps Land Chattels  No. of Paddocks Land  Rural Water House Rural  Rural Water Tank Rural  Gas Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Stove Chattels  Septic Sewage  Other ...",
      "overlay": "AUCTION THURSDAY",
      "isGSTInclusive": true,
      "landUse": [
        "Lifestyle"
      ],
      "floorArea": 0,
      "landArea": 10002,
      "pendingLiveDate": "2024-10-08T11:00:00+00:00",
      "auctionDateTime": "2024-11-07T01:00:00+00:00",
      "auctionLocation": "Pukekohe Branch",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-09T03:19:36+00:00"
    },
    {
      "listingNumber": 897437,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Section",
      "geoLat": -36.856174,
      "geoLong": 174.83719,
      "geoCodeWgs": "POINT (174.83720397949219 -36.856174468994141)",
      "street": "2/130B Kohimarama Road",
      "streetNumber": "2/130B",
      "streetOnly": "Kohimarama Road",
      "suburb": "Kohimarama",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7kxtt.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kxts.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kxv3.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kxtw.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kxty.jpg"
      ],
      "imageCount": 22,
      "video": "www.youtube.com/embed/YzVG3TNhHRY?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-04T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "Spacious & Sunny with Valley Views",
      "adSummary": "Nestled away from the road, built for easy living where all you’ll want to do is relax and soak in the wonderful views across the valley below. This meticulously maintained duplex property offers executive style living perfect for families, downsizers, and professionals seeking both comfort and convenience:\n\nContemporary Design with Modern Finishes: Constructed in the 1970s from concrete block and vertical wooden battening.\n\n• Bright & Spacious Interior: The open plan living / dining area is bathed in natural light from full-length windows. \n• You can step out onto the balcony to soak up the morning sun with sweeping valley views.\n• Upstairs Comfort: The upper-level houses two spacious, light-filled double bedrooms. One has access to a private balcony where the views are at their finest.\n• Versatile Spaces: One of the 3 bedrooms is on the main level and has been used as a second living/media room, enjoying direct access to a private North-facing deck.\n• Ample Parking & Storage: Enjoy the convenience of a large double garage with a built-in workbench.\n \nWith its prime location, you’re just moments from the highly regarded Kohimarama School, beautiful beaches, and vibrant cafes. The central city is also a swift commute away, making 2/130b Kohimarama Rd the ideal choice for those seeking an easy-care lifestyle or the convenience of a lock-up-and-leave in the Bays. ~#~ Spacious & Sunny with Valley Views ~#~ Kohimarama Road Kohimarama  Auckland City  Garage Garaging  Double Garaging  Weatherboard Exterior  Open Plan Dining  Modern Kitchen  Com. Bath/WCs Bathrooms  Aluminium Joinery  Local Views  Wide Views  Level Section Con  Longrun Roof  Decking Features  Pantry Features  Walk-in Wardrobe Features  Block Base  Partially Fenced Fencing  Family Rooms  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Waste Disposal Unit Chattels  Refrigerator ...",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1571,
      "pendingLiveDate": "2024-10-14T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T13:30:08+00:00"
    },
    {
      "listingNumber": 893936,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.88047,
      "geoLong": 175.03606,
      "geoCodeWgs": "POINT (175.03607177734375 -36.880474090576172)",
      "street": "1 Swordfish Place",
      "streetNumber": "1",
      "streetOnly": "Swordfish Place",
      "suburb": "Maraetai",
      "region": "Manukau City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m8df.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m8dg.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m8dx.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m8dz.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m8e0.jpg"
      ],
      "imageCount": 36,
      "video": "www.youtube.com/embed/813jYtmuuYA?rel=0",
      "price": "For Sale by Tender",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 6,
      "adHeadline": "Hook, Line, and Sinker",
      "adSummary": "Welcome aboard to your dream home in Maraetai! Cast your gaze upon 1 Swordfish Place, where the waters of coastal living flow effortlessly.\n\nReel in the excitement as you explore this single-level brick and tile residence. Inside, the open-plan layout hooks you from the start, seamlessly connecting the living, kitchen, and dining areas like a well-crafted angler's knot. Step onto the sun-drenched North facing covered decking – your personal fishing pier – complete with a pergola that's the perfect catch for any weather.\n\n- Four spacious bedrooms, each a treasure trove of comfort, with the master suite standing tall as the captain's quarters with its own ensuite\n\n- Low maintenance living, leaving you more time to drop a line and reel in the day's catch\n\n- Ample space for a boat or campervan, ensuring your coastal escapades are never hampered\n\n- Access to one of Auckland's best beaches, where the fish are always biting, along with beachfront restaurants, cafes, and the private boat club\n\n- Nearby amenities include reputable schools, parks, and shopping centres – the perfect bait for any discerning homebuyer\n\nThe allure of single-level living combined with the durability of brick and tile construction is the perfect bait, reeling in homebuyers with its promise of coastal comfort.\n\nDon't let this catch of a lifetime slip through your fingers! Contact us today to schedule a viewing and dive headfirst into the ultimate coastal lifestyle at 1 Swordfish Place in Maraetai. ~#~ Hook, Line, and Sinker ~#~ Swordfish Place Maraetai  Manukau City  Garage Garaging  Double Garaging  Off Street Parking Garaging  Brick Exterior  Combined Kitchen Dining  Standard Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Aluminium Joinery  Urban Views  Private Views  Sloping Section Con  Concrete Tile Roof  Decking Features  Walk-in Wardrobe Features  Concrete Base  Fully Fenced Fencing  Family Rooms  Separate Lounge Rooms  Conservatory Rooms  Dining Room Rooms  Rural Feature Rural  Rural Water Tank Rural  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T02:00:00+00:00",
      "overlay": "TENDER CLOSES WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 761,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "tenderDateTime": "2024-11-06T03:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-15T22:59:49+00:00"
    },
    {
      "listingNumber": 900488,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.967045,
      "geoLong": 174.93394,
      "geoCodeWgs": "POINT (174.9339599609375 -36.967044830322266)",
      "street": "9 Pumau Place",
      "streetNumber": "9",
      "streetOnly": "Pumau Place",
      "suburb": "Flat Bush",
      "region": "Manukau City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m56y.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m56x.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m66v.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m66t.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m572.jpg"
      ],
      "imageCount": 27,
      "video": "www.youtube.com/embed/4kDmfd4TG9A?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-04T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 3,
      "parkingCount": 2,
      "adHeadline": "Brand New Family Home in Mission Heights Zone",
      "adSummary": "Experience luxury living at 9 Pumau Place, a brand-new, double-story home that combines modern elegance with ultimate comfort, nestled at the end of a peaceful cul-de-sac, backing onto a serene bush reserve.\n\nThe ground floor features a sleek, contemporary kitchen that flows into a stylish living area and an open-plan dining/family room. Step outside to the deck and beautifully landscaped garden, perfect for entertaining. An internal-access garage adds extra convenience for busy households.\n\nUpstairs, you’ll find 4 generous bedrooms and a spacious study room, including 2 master suites. One of the double bedroom offers a private balcony, perfect for soaking in scenic views. A well-appointed tiled bathroom serves the other bedrooms, ensuring space for everyone.\n\nLocated in the highly desirable Mission Heights school zone, this home is close to Mission Heights Primary, Mission Heights Junior College, Ormiston Senior College, and Sancta Maria College. You&#39;ll also enjoy easy access to local shops, parks, and transport links—everything your family needs for modern living.\n\nDon’t miss this opportunity—call us today to arrange a private viewing and make this beautiful home yours! ~#~ Brand New Family Home in Mission Heights Zone ~#~ Pumau Place Flat Bush  Manukau City  Garage Garaging  Single Garaging  Off Street Parking Garaging  Exterior Other Exterior  Gas (Reticulated) Kitchen  GAS CookTop Kitchen  Modern Kitchen  Ensuite Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Bush Views  Level Section Con  Color Steel Roof  Decking Features  Concrete Base  Fully Fenced Fencing  Family Rooms  Separate Lounge Rooms  Office/Study Rooms  Dining Room Rooms  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "AUCTION TOMORROW",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 0,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T00:00:00+00:00",
      "auctionLocation": "Highbrook Drive",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-15T13:32:39+00:00"
    },
    {
      "listingNumber": 900511,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.886772,
      "geoLong": 174.99884,
      "geoCodeWgs": "POINT (174.99884033203125 -36.886775970458984)",
      "street": "51 Beachlands Road",
      "streetNumber": "51",
      "streetOnly": "Beachlands Road",
      "suburb": "Beachlands",
      "region": "Manukau City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m9p7.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9pf.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9pa.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9pb.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9pc.jpg"
      ],
      "imageCount": 17,
      "video": "www.youtube.com/embed/zruUpa9vKLA?rel=0",
      "price": "For Sale by Tender",
      "settlementDate": "2024-12-03T11:00:00+00:00",
      "bedroomCount": 6,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "The Smart Money ",
      "adSummary": "This legal home and income with great separation and privacy between the dwellings, set on a freehold 1011sqm section that is centrally located in the middle of Beachlands, that’s The Smart Money.\n\nIf you’re just starting down the investor path or already an experienced investor looking to add to your portfolio, you’ll agree, having two separate income streams off the one property, that’s The Smart Money.\n\nIf you’re looking for your own property to live in but want or need a helping hand to pay the mortgage, simply live in one and rent out the other, that’s The Smart Money.\n\nIf you’re looking for a property for multi generational family living with separate four bedroom and two bedroom accommodations, now that’s The Smart Money.\n\nWith interest rates dropping, maybe you’re just looking to purchase at the bottom of the price cycle, that’s The Smart Money.\n\nLocated within a short distance to Beachlands School, domain, village, Sunkist Bay Beach, Marina, Ferry to CBD, Golf course, shopping centre and more, that’s The Smart Money.\n\nThe Smart Money say’s this one won’t last long, call the MKS Matt Kath Stu team now to secure your opportunity to own 51 Beachlands Road. ~#~ The Smart Money  ~#~ Beachlands Road Beachlands  Manukau City  Carport Garaging  Weatherboard Exterior  Exterior Other Exterior  Combined Lounge Dining  Standard Kitchen  Butlers Pantry Kitchen  Com. Bath/WCs Bathrooms  Aluminium Joinery  Local Views  Level Section Con  Iron Roof  Decking Features  Pole Base  Fully Fenced Fencing  Separate Lounge Rooms  Rural Feature Rural  Rural Feature Rural  Rural Water Tank Rural  Heat Pump Heating  Heating Other Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Stove Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T01:00:00+00:00",
      "overlay": "TENDER CLOSES WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1011,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "tenderDateTime": "2024-11-06T03:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T05:08:51+00:00"
    },
    {
      "listingNumber": 900812,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -37.21577,
      "geoLong": 174.90509,
      "geoCodeWgs": "POINT (174.90509033203125 -37.215770721435547)",
      "street": "15 Trevors Place",
      "streetNumber": "15",
      "streetOnly": "Trevors Place",
      "suburb": "Pukekohe",
      "region": "Franklin District",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m9tb.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9t9.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9tn.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9tm.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9tj.jpg"
      ],
      "imageCount": 18,
      "video": "www.youtube.com/embed/11U9GUcenzs?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-12T11:00:00+00:00",
      "bedroomCount": 5,
      "bathroomCount": 2,
      "parkingCount": 4,
      "adHeadline": "Perfect Family Home",
      "adSummary": "Quiet cul-de-sac, safe for children and pets\n\nStep into this wonderful brick and tile 210sqm home, offering the ultimate combination of space, style, and comfort. Nestled on a generous 616sqm section in a family-friendly cul-de-sac, this home is in zone for the sought-after Hill School. With five bedrooms, a modern kitchen, and a fantastic covered outdoor entertaining area, it’s the perfect spot for year-round gatherings. Safe, spacious, and designed for family living, you won’t want to miss out on this gem!\n\nFive bedrooms, four of which are spacious; master includes ranchslider to the patio, large walk-in wardrobe, and ensuite\n\n• Large lounge with heat pump and ranchslider onto the covered patio\n• Open-plan living and dining area\n• Modern kitchen with sleek cabinetry, a large window overlooking the backyard, double dish drawers, and plenty of storage\n• Multiple large storage cupboards throughout the home\n• Family bathroom with a relaxing bathtub and separate toilet\n• Stylish tiles in entrance, kitchen, and bathrooms, plush carpet throughout the rest\n• Double glazing for year-round comfort\n• Double garage with internal access, includes laundry\n• Zoned for popular Pukekohe Hill School\n\nThis home offers everything a growing family or professional couple could need! Call today to arrange a viewing and make this exceptional property yours\n\n ~#~ Perfect Family Home ~#~ Trevors Place Pukekohe  Franklin District  Garage Garaging  Double Garaging  Off Street Parking Garaging  Brick Exterior  Open Plan Dining  Combined Lounge Dining  Combined Kitchen Dining  Designer Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Mixed Section Con  Concrete Tile Roof  Pantry Features  Spa Features  Walk-in Wardrobe Features  Fully Fenced Fencing  Family Rooms  Separate Laundry Rooms  Separate Lounge Rooms  Rural Water Town Rural  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Burglar Alarm Chattels  Other Chattels ...",
      "overlay": "AUCTION THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 616,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-07T01:00:00+00:00",
      "auctionLocation": "Pukekohe Branch",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-15T22:19:52+00:00"
    },
    {
      "listingNumber": 900703,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Apartment",
      "geoLat": -36.902344,
      "geoLong": 174.81366,
      "geoCodeWgs": "POINT (174.81365966796875 -36.90234375)",
      "street": "6/36 Wilkinson Road",
      "streetNumber": "6/36",
      "streetOnly": "Wilkinson Road",
      "suburb": "Ellerslie",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m8vh.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m8vm.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m8vk.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m8vq.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m8vp.jpg"
      ],
      "imageCount": 18,
      "video": "www.youtube.com/embed/ihk6FOqj2-g?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-03T11:00:00+00:00",
      "bedroomCount": 2,
      "bathroomCount": 1,
      "parkingCount": 1,
      "adHeadline": "Stylish Ground Floor Garden Apartment",
      "adSummary": "We’re delighted to present the latest unit to be released for sale in this boutique apartment complex built by the renowned Ockham group 11 years ago. With 3 of the 10 units now sold, this opportunity is for an astute buyer to secure Unit 6 of the 'Wamaka' complex.\n\nLike the others, this comes fully refurbished and features 2 bedrooms, a bathroom, a separate laundry area, an open-plan living space, and a private covered outdoor deck. The difference with this apartment is that it’s on the ground floor, with a peaceful outlook over the immaculate gardens with gorgeous evening sun.\n\nUnit 6, in the more secluded rear block, comes with an assigned parking spot located in the secure undercover car park, with access to the entire complex provided by electronic gates.\n\nIdeal for an executive single, a young couple, or anyone seeking a centrally located, lock-up-and-leave residence, this apartment promises quality and character. The concrete breezeblock construction is top-notch, with decorative patterned hollows in the stairwells and balconies adding a unique artistic appeal for the discerning buyer.\n\nSituated just minutes from buses, trains, and Ellerslie village, this is your chance to join a distinguished development that is proving popular with buyers looking for great value in this market. We welcome you to come and inspect through an Open Home or by appointment. ~#~ Stylish Ground Floor Garden Apartment ~#~ Wilkinson Road Ellerslie  Auckland City  Garage Garaging  Single Garaging  Concrete Block Exterior  Concrete Exterior  Open Plan Dining  Modern Kitchen  Com. Bath/WCs Bathrooms  Aluminium Joinery  City Views  Local Views  Wide Views  Urban Views  Level Section Con  Iron Roof  Decking Features  Concrete Base  Fully Fenced Fencing  Heat Pump Heating  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Refrigerator Chattels  Other Chattels ...",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 0,
      "pendingLiveDate": "2024-10-17T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-17T13:31:07+00:00"
    },
    {
      "listingNumber": 900840,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -37.05293,
      "geoLong": 174.93848,
      "geoCodeWgs": "POINT (174.9384765625 -37.052932739257813)",
      "street": "27A Arimu Road",
      "streetNumber": "27A",
      "streetOnly": "Arimu Road",
      "suburb": "Papakura",
      "region": "Papakura District",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mf5n.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mf62.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mf61.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mf5y.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mf60.jpg"
      ],
      "imageCount": 29,
      "video": "www.youtube.com/embed/qWpXigYB9mE?rel=0",
      "price": "For Sale by Tender",
      "settlementDate": "2025-02-03T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "FAMILY-FRIENDLY FABULOUS!!",
      "adSummary": "We invite you to discover this stunning 4-bedroom home, where modern comfort meets outdoor charm. Perfect for families or anyone seeking a peaceful retreat, this property features spacious living areas with 2.7-meter high ceilings and inviting outdoor spaces. Come see what makes this home special!\n\nKey Features:\n\n• Land Size: 413m², providing plenty of room to breathe and enjoy the outdoors.\n• Floor Area: 159m² of thoughtfully designed living space, ensuring comfort in every corner.\n• 4 Spacious Bedrooms: Ideal for family living, with ample closet space and natural light.\n• 2.5 Elegant Bathrooms: Enjoy convenience and style.\n• Double Garage: Plenty of room for your vehicles, plus additional parking for guests.\n• Deck with Pergola & Rolling Outdoor Screen: Perfect for privacy, outdoor entertaining, summer barbecues, or relaxing with a book.\n• Beautiful Garden Space: A lush area for gardening enthusiasts, kids to play, or simply unwinding in nature.\n• Automatic Electric Gate: Added security and ease of access for peace of mind.\n\nCall us today to arrange a viewing and make this beautiful property your new home!  Don’t let this opportunity slip away! We can’t wait to welcome you! ~#~ FAMILY-FRIENDLY FABULOUS!! ~#~ Arimu Road Papakura  Papakura District  Garage Garaging  Double Garaging  Garaging Other Garaging  Weatherboard Exterior  Open Plan Dining  GAS CookTop Kitchen  Modern Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Level Section Con  Color Steel Roof  Walk-in Wardrobe Features  Concrete Base  Fully Fenced Fencing  Gas Heating  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "TENDER CLOSES THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 413,
      "pendingLiveDate": "2024-10-16T11:00:00+00:00",
      "tenderDateTime": "2024-11-07T03:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-17T00:48:41+00:00"
    },
    {
      "listingNumber": 899418,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Townhouse",
      "geoLat": -37.013638,
      "geoLong": 174.93164,
      "geoCodeWgs": "POINT (174.93165588378906 -37.013637542724609)",
      "street": "11/7 Wastney Road",
      "streetNumber": "11/7",
      "streetOnly": "Wastney Road",
      "suburb": "Alfriston",
      "region": "Manukau City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mcr7.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mcr8.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mcrb.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mcbr.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mcbt.jpg"
      ],
      "imageCount": 25,
      "video": "www.youtube.com/embed/M0DhgbBuA6c?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-11T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 3,
      "adHeadline": "Affordable, Low Maintenance In A Gated Community",
      "adSummary": "Nestled in the picturesque surroundings of Alfriston, this beautiful standalone home offers the perfect blend of modern living and natural beauty. Surrounded by lush farmland, the scenic environment creates a tranquil and idyllic lifestyle. Located within a secure, gated community with visitor parking, this home is ideal for those seeking peace of mind.\n\n• Standalone, low-maintenance home in a fully fenced, secure gated community.\n• One-of-a-kind art wall in the entryway – a unique, handmade world map with tiled stone, adding character to the home.\n• 4 spacious bedrooms, including a luxurious master suite with a walk-in wardrobe.\n• 2 modern tiled bathrooms with underfloor heating\n• An extra toilet on the ground floor for guest convenience\n• Open-plan living and dining area, ideal for family gatherings and entertaining.\n• Modern kitchen with a walk-in pantry, offering ample storage and convenience.\n• Single internal garage, plus single carport for added convenience.\n• Additional study space upstairs, perfect for working from home or study.\n• Fully fenced garden, safe for kids and pets, and easy to maintain.\n\nWith the owners already planning their next chapter, this is your chance to secure an affordable, low-maintenance lifestyle in the serene community of Alfriston. Make this dream home yours today! ~#~ Affordable, Low Maintenance In A Gated Community ~#~ Wastney Road Alfriston  Manukau City  Garage Garaging  Single Garaging  Off Street Parking Garaging  Exterior Other Exterior  Open Plan Dining  Combined Kitchen Dining  Modern Kitchen  Butlers Pantry Kitchen  Ensuite Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Rural Views  Level Section Con  Color Steel Roof  Walk-in Wardrobe Features  Concrete Base  Fully Fenced Fencing  Family Rooms  Dining Room Rooms  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-08T22:00:00+00:00",
      "overlay": "AUCTION TOMORROW",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 0,
      "pendingLiveDate": "2024-10-16T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T00:00:00+00:00",
      "auctionLocation": "Highbrook Drive",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T13:30:40+00:00"
    },
    {
      "listingNumber": 899978,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.88582,
      "geoLong": 174.68939,
      "geoCodeWgs": "POINT (174.68939208984375 -36.885822296142578)",
      "street": "113 Holly Street",
      "streetNumber": "113",
      "streetOnly": "Holly Street",
      "suburb": "Avondale",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m2vp.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m2w0.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m2vq.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m2vs.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m2vt.jpg"
      ],
      "imageCount": 17,
      "video": "www.youtube.com/embed/Aj3hb9HywqI?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2025-01-22T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 1,
      "parkingCount": 6,
      "adHeadline": "CHECK OUT THE VIEW! ",
      "adSummary": "We are excited to present a fantastic opportunity in one of Avondale's most sought-after streets. This charming three-bedroom weatherboard home sits on a generous 759m² freehold site.\n\nAs you step inside, you’ll appreciate the warm, inviting atmosphere of this home. The open-plan kitchen and living areas are filled with natural light. \n\nOne of the standout features of this property is its unique water view. Step out from your back door onto the generous deck to an entertainers paradise. Imagine waking up to this serene backdrop every day!\n\nBut wait there is more, great storage in the garage with the rear space offering a dedicated space for teenagers, work from home or a place to chill for you! \n\nLocation is key, and this home doesn’t disappoint. It’s zoned for Avondale Intermediate and Avondale College, making it an excellent choice for families with school-aged children. Plus, you’re just a stone's throw away from Avondale Village, which offers a vibrant array of shops, cafes, and bars. \n\nConvenience is further enhanced with easy motorway access, nearby sports fields, and reliable public transport options, ensuring you’re well-connected to the rest of the city.\n\nThis property is a fantastic opportunity for a variety of buyers—whether you’re a first-time home buyer eager to start your journey, a family seeking a central haven, an investor looking for a property with great potential, or a developer wanting to explore options on this sizable land zoned mixed housing urban.\n\nDon’t miss out on this incredible opportunity! Contact us today to schedule a viewing, we can't wait to show you around. ~#~ CHECK OUT THE VIEW!  ~#~ Holly Street Avondale  Auckland City  Garage Garaging  Double Garaging  Off Street Parking Garaging  Weatherboard Exterior  Combined Lounge Dining  Combined Kitchen Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Sep WC's Bathrooms  Wooden Joinery  Sea Views  Sloping Section Con  Decramastic Roof  Decking Features  Polished Floors Features  Wooden Base  Fully Fenced Fencing  Separate Lounge Rooms  Kent Style Fire Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 759,
      "pendingLiveDate": "2024-10-14T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:30:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T13:30:49+00:00"
    },
    {
      "listingNumber": 899741,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Section",
      "geoLat": -36.870296,
      "geoLong": 174.73573,
      "geoCodeWgs": "POINT (174.73574829101563 -36.87030029296875)",
      "street": "49A Finch Street",
      "streetNumber": "49A",
      "streetOnly": "Finch Street",
      "suburb": "Morningside",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7ma7g.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ma76.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ma78.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ma77.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ma7b.jpg"
      ],
      "imageCount": 13,
      "video": "www.youtube.com/embed/VmGYnp8YNvI?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2025-01-23T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 1,
      "parkingCount": 2,
      "adHeadline": "Roll Up Your Sleeves",
      "adSummary": "Bursting with potential and in a prime location, this solid 1980s cedar-clad home is ready for your creative touch. With good bones and an adaptable layout, it’s a blank canvas waiting for someone to realise the possibilities.\n\nProudly perched on an elevated site with an expansive outlook across the surrounding neighbourhood and positioned perfectly for all-day sun, this home is ready for its potential to be maximised. With some minor TLC, you can move right in and enjoy immediate comfort while making plans to add value and reap the rewards.\n\nStep outside and be embraced by established gardens and lush foliage that give the property a sense of enchantment. The vibrant greenery creates a serene, picturesque atmosphere, perfect for unwinding with a morning coffee or hosting guests. With minimal upkeep required, you can enjoy the tranquil garden setting year-round, while still having plenty of space to add your own personal touches—whether it’s a vege garden or a cosy corner for outdoor relaxation.\n\nA large covered carport with plenty of storage adds a layer of convenience and solves all your storage needs.\n\nLocated in prime Western Springs, enjoy the tranquillity of a mature neighbourhood while being just moments from Morningside’s cafes, microbreweries, and restaurants. Grey Lynn, Ponsonby, and Pt Chevalier are also a quick drive away, offering even more dining and entertainment options.\n\nOur vendors are leaving Auckland and are committed to selling - preferably at auction. Don’t miss this rare opportunity to unlock the potential on offer. Contact Ben or Matt today to arrange a viewing! ~#~ Roll Up Your Sleeves ~#~ Finch Street Morningside  Auckland City  Off Street Parking Garaging  Single Carport Garaging  Carport Garaging  Cedar Exterior  Open Plan Dining  Standard Kitchen  Sep Bathrooms Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Local Views  Wide Views  Level Section Con  Longrun Roof  Decking Features  Pantry Features  Wooden Base  Partially Fenced Fencing  Family Rooms  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Stove Chattels  Burglar Alarm Chattels  Refrigerator ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "AUCTION THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 759,
      "pendingLiveDate": "2024-10-16T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T13:30:52+00:00"
    },
    {
      "listingNumber": 900056,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.89931,
      "geoLong": 174.70099,
      "geoCodeWgs": "POINT (174.70098876953125 -36.899311065673828)",
      "street": "2/179 Blockhouse Bay Road",
      "streetNumber": "2/179",
      "streetOnly": "Blockhouse Bay Road",
      "suburb": "Avondale",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mdbz.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mdbw.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mdbr.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mdbt.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mdbq.jpg"
      ],
      "imageCount": 17,
      "video": "www.youtube.com/embed/Kx-9UrjgqNQ?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2025-01-14T11:00:00+00:00",
      "bedroomCount": 2,
      "bathroomCount": 1,
      "parkingCount": 2,
      "adHeadline": "Private, Sun-Filled Haven with Modern Comforts",
      "adSummary": "Nestled away from the road, this beautifully renovated home offers a tranquil, light-filled retreat. Lovingly updated by the current owners, it seamlessly blends indoor and outdoor living, creating an expansive feel perfect for entertaining or simply enjoying everyday life.\n\nHost friends and family with ease this summer in the lush, landscaped garden, complete with a productive vegetable patch. The generous storage space beneath the house adds significant value, while inside, you’ll find a brand-new, thoughtfully designed kitchen, a renovated bathroom, and ample storage in the bedrooms.\n\nIdeal for first-home buyers looking for a move-in ready property or investors taking advantage of favorable interest rates, this home is perfectly positioned with easy access to public transport, motorways, and amenities.\n\nDon’t miss out—our motivated owners are ready for their next chapter, and we’d love to show you through. Call today! ~#~ Private, Sun-Filled Haven with Modern Comforts ~#~ Blockhouse Bay Road Avondale  Auckland City  Off Street Parking Garaging  Weatherboard Exterior  Open Plan Dining  Modern Kitchen  Com. Bath/WCs Bathrooms  Aluminium Joinery  Mixed Section Con  Iron Roof  Decking Features  Pantry Features  Polished Floors Features  Wooden Base  Partially Fenced Fencing  Basement Rooms  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Waste Disposal Unit ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 673,
      "pendingLiveDate": "2024-10-16T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:30:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T20:06:37+00:00"
    },
    {
      "listingNumber": 900030,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Section",
      "geoLat": -37.01303,
      "geoLong": 174.89546,
      "geoCodeWgs": "POINT (174.89547729492188 -37.013034820556641)",
      "street": "1/27 Grande Vue Road",
      "streetNumber": "1/27",
      "streetOnly": "Grande Vue Road",
      "suburb": "Hill Park",
      "region": "Manukau City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7ma93.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mddy.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mdhf.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ma8t.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ma91.jpg"
      ],
      "imageCount": 25,
      "video": "www.youtube.com/embed/dUPwGrZhQY8?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-18T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 5,
      "adHeadline": "Grande Vue by name, Grand Views by nature ",
      "adSummary": "Every street has those iconic homes that simply stand out - everybody knows them, and everybody loves them, and that's exactly what we have right here in one of Hillpark's most renowned streets - perfectly poised with elevated views, this is one first impression that's sure to leave its mark.\n\nStylishly crafting classic charm with the modern world, this gorgeous allrounder of a property has everything you could ask for wrapped up in one complete package. This captivating home has instantaneous appeal that welcomes you upon entry showcasing open-plan living, 4 bedrooms plus a study and two full bathrooms that will more than cater for your growing family’s needs. Sophistication with a custom-designed kitchen by Kitchen Craft is a culinary haven for our foodies while blending harmoniously with warm polished hardwood floors and a homely, humble design giving a timeless feel to your home.\n\nYour single internal garage is always a nice touch, coupled with a fantastic outdoor decking area, and loads of off-street parking for every vehicle in the fleet, simply completing this perfect family property. So whether it's enjoying family time downstairs, or ascending to your sleeping quarters up top, this clever tri-level design is the perfect use of space affording room for the entire family to stretch out across a genius floor area.\n\nOutside, this beautiful facade displays classic architecture, immaculately maintained exteriors, elevated road front aspect, its own private driveway that leads straight into your internal garage, and fully fenced front and back yards. Inside the story continues with ample dining to complement your pristine kitchen setting, combining with your North-facing family room capturing the heart of your home in all-day natural light. And with the handy added bonus of having one of your bedrooms and a full family bathroom on the ground level, it plays right into the wheelhouse for extended family living or having guests stay over. Plus, the added creature comforts of a heat pump, full insulation throughout the entire house including in the walls that accompanied a complete internal re-jibbing, LED lights, recently replaced colour steel roof, and all security alarmed for your peace of mind.\n\nLove entertaining? Then you’ll love this stylish indoor-outdoor flow from the heart of your home to your private back deck and entertainment area, making family gatherings or summertime barbeques with the mates a snap! And rest assured with that security of a fully-fenced yard for kids and puppy to play safe and low-maintenance green areas means your weekends are once again your own.\n\nProximity to everything these days is far becoming a priority, and this locale speaks for itself with only 60 seconds to city-bound motorway access, 6 minutes to Westfield Manukau, 16 minutes to Auckland International Airport, and only 24 minutes to Auckland CBD- connected by location takes on a whole new meaning. And best of all, it's only a 3-minute stroll to the most sought-after Hillpark School, Hillpark shops, bakery and takeaways, and an easy walk to our favourite cafes, dog park, and stunning botanical gardens.\n\nLove your home... love your area… love your family time… as this home knocks it out the park on every level. So please give us a call today and let's take a walk through what might just be your next home. ~#~ Grande Vue by name, Grand Views by nature  ~#~ Grande Vue Road Hill Park  Manukau City  Garage Garaging  Internal Access Garaging  Single Garaging  Off Street Parking Garaging  Weatherboard Exterior  Open Plan Dining  Combined Lounge Dining  Combined Kitchen Dining  Designer Kitchen  GAS CookTop Kitchen  Com. Bath/WCs Bathrooms  Wooden Joinery  Local Views  Urban Views  Level Section Con  Color Steel Roof  Decking Features  Polished Floors Features  Partially Fenced Fencing  Rooms Other Rooms  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "AUCTION SATURDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1214,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-09T04:00:00+00:00",
      "auctionLocation": "On site",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T02:00:36+00:00"
    },
    {
      "listingNumber": 899122,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Section",
      "geoLat": -36.86639,
      "geoLong": 174.79984,
      "geoCodeWgs": "POINT (174.79983520507813 -36.86639404296875)",
      "street": "2/266 Victoria Avenue",
      "streetNumber": "2/266",
      "streetOnly": "Victoria Avenue",
      "suburb": "Remuera",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7jwbn.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jwb4.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jwb0.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jwb9.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jwb2.jpg"
      ],
      "imageCount": 26,
      "video": "www.youtube.com/embed/5SDG1X96ooo?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-04T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 4,
      "adHeadline": "CLASSIC FRESH TOWNHOUSE",
      "adSummary": "Traditional brick and cedar on the outside with a beautifully transformed interior, this tantalizing low-maintenance townhouse is ideal for all ages. \n\nWith a welcoming blend of sunlight and quality refurbishment, the generous living spaces have a natural flow opening directly to a sizeable private north-facing landscaped garden, which also has a separate paved area for parking another car or toys! Immaculate throughout, features include an up-to-the-minute kitchen, butler’s pantry, 3 large double bedrooms + study, fully tiled bathrooms, solid timber floors and wooden blinds. \n\nSo well situated with easy level access, whether upsizing, downsizing or a family seeking Victoria Avenue Primary, Grammar zones or proximity to leading schools close by, this refreshing property is a perfect proposition with relaxed contemporary living. ~#~ CLASSIC FRESH TOWNHOUSE ~#~ Victoria Avenue Remuera  Auckland City  Garage Garaging  Internal Access Garaging  Double Garaging  Off Street Parking Garaging  Garaging Other Garaging  Brick Exterior  Cedar Exterior  Separate Dining  Designer Kitchen  Modern Kitchen  Butlers Pantry Kitchen  Ensuite Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Local Views  Urban Views  Level Section Con  Concrete Tile Roof  Walk-in Wardrobe Features  Concrete Base  Fully Fenced Fencing  Separate Lounge Rooms  Office/Study Rooms  Dining Room Rooms  Heat Pump Heating  Heating Other Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T01:30:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1060,
      "pendingLiveDate": "2024-10-07T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-07T13:31:25+00:00"
    },
    {
      "listingNumber": 899610,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Section",
      "geoLat": -36.89479,
      "geoLong": 174.9091,
      "geoCodeWgs": "POINT (174.90910339355469 -36.894794464111328)",
      "street": "1/24 Cranberry Place",
      "streetNumber": "1/24",
      "streetOnly": "Cranberry Place",
      "suburb": "Bucklands Beach",
      "region": "Manukau City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7jmq6.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jmpy.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jmpz.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jmq5.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jmpw.jpg"
      ],
      "imageCount": 22,
      "video": "www.youtube.com/embed/SQBo7fQDTag?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-14T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 4,
      "adHeadline": "Act Now! Elevated Family Living with Super Views",
      "adSummary": "Tucked away in the quiet cul-de-sac of Cranberry Place, this beautifully maintained home offers privacy and peace, while being just moments from everything you need. Three spacious double bedrooms provide plenty of room for the family.\n\nOpen-Plan Living, Made for Entertaining! Step into bright and airy living area where the lounge, dining, and kitchen flow seamlessly together, ideal for family moments or entertaining guests. Large windows flood the home with light, with high stud ceiling, showcasing stunning elevated views, while the heat pump ensures year-round comfort.\n\nOutdoor Paradise: Enjoy sweeping views from your wraparound decking, the perfect spot for outdoor dining or unwinding after a long day. The fully fenced sun-soaked backyard offers a safe haven for kids and pets, with room for a veggie patch or fruit trees to complete your outdoor retreat.\n\nKey Features:\n- Double garage with internal access plus off-street parking—space and security for everyone.\n- Separate laundry area for added convenience.\n\nPrime Location: Only minutes from Howick Village, Half Moon Bay Marina, supermarkets, dining options, and public transport, this home offers unbeatable convenience. Plus, it's in-zone for good schools—making it perfect for growing families.\n\nHurry! Homes in this sought-after Bucklands Beach location move fast. Contact us today for more details or to book a viewing—before someone else snaps it up! ~#~ Act Now! Elevated Family Living with Super Views ~#~ Cranberry Place Bucklands Beach  Manukau City  Garage Garaging  Internal Access Garaging  Double Garaging  Off Street Parking Garaging  Combined Lounge Dining  Combined Kitchen Dining  GAS CookTop Kitchen  Modern Kitchen  Gas (Bottled) Kitchen  Com. Bath/WCs Bathrooms  City Views  Sloping Section Con  Iron Roof  Fully Fenced Fencing  Family Rooms  Rural Water Town Rural  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Waste Disposal Unit ...",
      "nextOpenHome": "2024-11-07T05:00:00+00:00",
      "overlay": "AUCTION TOMORROW",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1258,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T00:00:00+00:00",
      "auctionLocation": "Highbrook Drive",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-15T13:31:24+00:00"
    },
    {
      "listingNumber": 900369,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Section",
      "geoLat": -36.79971,
      "geoLong": 174.69128,
      "geoCodeWgs": "POINT (174.69129943847656 -36.799709320068359)",
      "street": "219 Rangatira Road",
      "streetNumber": "219",
      "streetOnly": "Rangatira Road",
      "suburb": "Beach Haven",
      "region": "North Shore City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mbhc.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m59k.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m59n.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m5ax.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m59g.jpg"
      ],
      "imageCount": 24,
      "video": "www.youtube.com/embed/l84Ph89-rRg?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-11T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 1,
      "adHeadline": "A Spot For Everyone To Enjoy! ",
      "adSummary": "Step into your own little oasis with this super homely and well-maintained property! Nestled in the heart of Beach Haven, this charming abode boasts 3 double bedrooms, perfect for your growing family or hosting guests.\n\nRelax and unwind in the many chill-out spots this home offers - perfect for lazy Sunday afternoons or entertaining friends and family. Picture yourself sipping a cup of coffee in the morning sun or enjoying a BBQ in the evening breeze.\n\nLive the ultimate convenience with amenities galore just a stone's throw away - parks, malls, and public transport, including the Ferry Terminal, all within easy reach. Imagine strolling through lush parks or setting off on a ferry adventure whenever the mood strikes.\n\nNeed space for your wheels or extra bits and bobs? No worries! With ample car parking, storage under the house and in the sheds in the back garden, you'll never run out of room for your treasures.\n\nThis property has all the makings of a dream home - from the cozy bedrooms to the main bathroom and ensuite, every corner exudes comfort and style. There are so many things to love about this home - come see for yourself and make it yours today! ~#~ A Spot For Everyone To Enjoy!  ~#~ Rangatira Road Beach Haven  North Shore City  Single Carport Garaging  Carport Garaging  Weatherboard Exterior  Combined Kitchen Dining  Standard Kitchen  Ensuite Bathrooms  Com. Bath/WCs Bathrooms  Mixed Joinery  Local Views  Mixed Section Con  Longrun Roof  Decking Features  Pole Base  Partially Fenced Fencing  Family Rooms  Separate Lounge Rooms  Office/Study Rooms  Sunroom Rooms  Dining Room Rooms  Rural Water Town Rural  Heat Pump Heating  Wood Fire Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Burglar Alarm Chattels  Waste Disposal Unit ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1009,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T20:30:00+00:00",
      "auctionLocation": "The Promenade",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-16T00:13:20+00:00"
    },
    {
      "listingNumber": 900184,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Unit",
      "geoLat": -36.85011,
      "geoLong": 174.8602,
      "geoCodeWgs": "POINT (174.86019897460938 -36.8501091003418)",
      "street": "3/21  Vale Road",
      "streetNumber": "3/21",
      "streetOnly": "Vale Road",
      "suburb": "St Heliers",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m5js.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m5jw.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m5ka.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7n6eg.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m5kb.jpg"
      ],
      "imageCount": 33,
      "video": "www.youtube.com/embed/9FqxmuFLPZY?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-04T11:00:00+00:00",
      "bedroomCount": 2,
      "bathroomCount": 1,
      "parkingCount": 1,
      "adHeadline": "WHERE WOULD YOU LIKE TO LIVE?",
      "adSummary": "• Less than 150m from one of the most beautiful beaches in Auckland\n\n• 10.7km scenic drive to City\n\n• 8km to motorway access for an easy commute\n\n• On the Tamaki Link bus route if you don't want to take the car\n\n• Relaxed Village atmosphere - cafes, restaurants & specialised shops are just a level stroll away\n\nWhether you are looking for your precious first home where you can still enjoy care free lifestyle or looking to downsize and enjoy every day this sunny, large, elevated home unit with a garage will offer you that. \n\nYour friends will be happy to pop in so you can go for a swim just down the road; your children and grandchildren will gladly visit and go for a bike ride or an ice cream. For special occasions or weekend catch ups you have selection of cafes and restaurants to visit. You do not even need to look for a parking spot.\n\nThis surprisingly spacious home offers a large living area with a surprising shaft view of the beach and waterfront promenade; easy to work in kitchen; two large double bedrooms; bathroom with bath and shower; separate laundry - all accompanied with plenty of storage. It can easily accommodate couples, singles or even small families. \n\nSecure this golden opportunity and make plans for wonderful summer and many more to come. Motivated sellers are offering flexible settlement options. ~#~ WHERE WOULD YOU LIKE TO LIVE? ~#~ Vale Road St Heliers  Auckland City  Garage Garaging  Single Garaging  Brick Exterior  Open Plan Dining  Combined Lounge Dining  Standard Kitchen  Sep Bathrooms Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Wide Views  Sea Views  Level Section Con  Decramastic Roof  Pantry Features  Other Features Features  Concrete Base  Partially Fenced Fencing  Separate Laundry Rooms  Separate Lounge Rooms  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener ...",
      "nextOpenHome": "2024-11-08T22:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1590,
      "pendingLiveDate": "2024-10-14T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T20:43:31+00:00"
    },
    {
      "listingNumber": 899489,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.79296,
      "geoLong": 174.73071,
      "geoCodeWgs": "POINT (174.730712890625 -36.792961120605469)",
      "street": "16 Orion Place",
      "streetNumber": "16",
      "streetOnly": "Orion Place",
      "suburb": "Hillcrest",
      "region": "North Shore City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7kxsx.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kxsv.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kxt5.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kxsy.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kxt1.jpg"
      ],
      "imageCount": 35,
      "video": "www.youtube.com/embed/GX9XxVTRjxg?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-28T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 1,
      "parkingCount": 2,
      "adHeadline": "Impeccably finished – move in and enjoy!",
      "adSummary": "Located at the end of a quiet cul-de-sac in lovely Hillcrest, 16 Orion Place is a remarkably modernised home, presenting a rare opportunity to reap the rewards of the owner’s meticulous work. With high-quality finishes, exceptional features, and a generous 738m² freehold plot beautifully cultivated into splendid front and back outdoor spaces, this property offers excellent value for those seeking premium housing\n\nAbout the Property:\nThe living areas accommodate relaxation and entertainment. Plush carpets and custom fitted window coverings add warmth and texture, whilst neutral tones create a peaceful retreat. The open-plan kitchen and conservatory area features quality appliances and stylish cabinetry - perfect for culinary enthusiasts and casual gatherings, flowing seamlessly out onto the large rear deck.  Beyond the expansive deck, you'll discover a creatively landscaped backyard featuring a well-manicured garden and inviting outdoor entertaining area with a spa.\n\nBathed in light, the three spacious bedrooms and newly renovated bathroom continue the theme of sophistication, providing a haven for rest and rejuvenation. The innovative 14kW ducted heating and cooling system enables comfortable temperature control year-round, with the ability to control different zones independently. It includes a wall controller and can also be operated via smartphone application.\n\nThe Location:\nHillcrest offers a range of terrific amenities while maintaining a strong community feel. Easy access to the motorway and proximity to the city makes it a very desirable location. You can enjoy peace of mind knowing you are buying in a well-established, neighbourly, and family-friendly area that remains popular with buyers. The property is in the zone for the sought-after Willow Park School and Northcote College, which is nearing completion of major redevelopment works.\n\nDon't miss out on this good opportunity, call the agents – now! ~#~ Impeccably finished – move in and enjoy! ~#~ Orion Place Hillcrest  North Shore City  Garage Garaging  Double Garaging  Weatherboard Exterior  Open Plan Dining  Modern Kitchen  Com. Bath/WCs Bathrooms  Color Steel Roof  Spa Features  Family Rooms  Dining Room Rooms  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "AUCTION THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 739,
      "pendingLiveDate": "2024-10-13T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T21:00:00+00:00",
      "auctionLocation": "The Promenade",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T21:43:52+00:00"
    },
    {
      "listingNumber": 900673,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Apartment",
      "geoLat": -36.85383,
      "geoLong": 174.7777,
      "geoCodeWgs": "POINT (174.7777099609375 -36.853828430175781)",
      "street": "3K/3 Cheshire Street",
      "streetNumber": "3K/3",
      "streetOnly": "Cheshire Street",
      "suburb": "Parnell",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m4ws.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4w9.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4w8.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4wa.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4wd.jpg"
      ],
      "imageCount": 25,
      "video": "www.youtube.com/embed/HLjAZ9zEwyU?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 1,
      "adHeadline": "Manhattan Living in Parnell",
      "adSummary": "Welcome to your inner city affordable sanctuary. \n\nThis perfectly positioned apartment offers so much, upstairs, you'll find three spacious bedrooms, including a master suite with a sizable ensuite. Situated on the sun-drenched western side of the complex this hidden gem boasts sweeping views of the Domain and city skyline. During the day, bask in the serene vista of the domain and museum, while at night, immerse yourself in the  glow of the city lights.\n\nLocation is everything, and this property hits the jackpot! Auckland's historic suburb offers a vibrant array of galleries, cafes, restaurants, and boutique shops right at your fingertips. Plus, you're just moments away from motorway access, Parnell Train Station, Auckland University, Auckland Hospital, the CBD, and Newmarket. And let's not forget – it's zoned for Parnell School and DGZ\n\nBut wait, there's more! Enjoy lazy summer days by the pool, stay fit in the onsite gym, or channel your inner Federer or Serena on the tennis court – the choice is yours.\n\nThis isn't just a property – it's a lifestyle waiting for you to embrace. Come on in and experience the magic for yourself.\n\nViewing by Appointment only - contact Dermot today to arrange your viewing. ~#~ Manhattan Living in Parnell ~#~ Cheshire Street Parnell  Auckland City  Garage Garaging  Single Garaging  Masonry Block/Brick Exterior  Open Plan Dining  Combined Kitchen Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Aluminium Joinery  City Views  Park Views  View Other Views  Sloping Section Con  Longrun Roof  Swimming Pool Features  Tennis Court Features  Other Features Features  Block Base  Fully Fenced Fencing  Separate Lounge Rooms  Rooms Other Rooms  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Waste Disposal Unit Chattels  Refrigerator Chattels  Other Chattels ...",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 0,
      "pendingLiveDate": "2024-10-14T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T20:03:29+00:00"
    },
    {
      "listingNumber": 900882,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -37.04607,
      "geoLong": 174.89687,
      "geoCodeWgs": "POINT (174.89686584472656 -37.046070098876953)",
      "street": "24 Castlehill Court",
      "streetNumber": "24",
      "streetOnly": "Castlehill Court",
      "suburb": "Wattle Downs",
      "region": "Manukau City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m9pk.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9pw.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9pz.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9q1.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m9q3.jpg"
      ],
      "imageCount": 21,
      "video": "www.youtube.com/embed/gP6pXLK9TVw?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-28T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 1,
      "parkingCount": 5,
      "adHeadline": "Brick & Tile Delight!",
      "adSummary": "Prepare to be enchanted by this special brick and tile residence, offering a generous floor area of approximately 190m2 on a 683m2 road frontage section. Nestled in the highly regarded cul-de-sac of Castlehill Court, the waterfront walkway is just steps away. Here you will discover the peninsula's coastal contours and reserves that makes this a delightful slice of paradise!\n\nImmerse yourself in the inviting ambiance that flows through this stunning property with an immaculate open plan expansive living area full of natural light which showcases neutral decor and spacious living. The central kitchen serves as a focal point, offering a delightful road frontage vantage point and looks through to the superb dining space. \n\nThe covered deck area provides an abundance of space to unwind and entertain while the garden gives a sense of tranquillity that is increasingly rare in our fast-paced world. On summer evenings, this is the perfect position to cool off and appreciate the beauty of this stunning position. The gardens are easy-care with a wide variety of established planting that adds to the allure of this remarkable property.\n\nAccommodating the needs of the entire family, this home boasts three generous bedrooms, a large family bathroom and separate laundry. \n\nA double internal access garage and generous off-street parking area, ensures ample space for all your vehicles. Our owners have kept the property impeccably maintained and this opportunity should not to be missed!\n\nIf you are a family who enjoys an active lifestyle and want to settle in an area that offers so much variety then look no further. Families will appreciate the proximity of Tington Park, located close by. ~#~ Brick & Tile Delight! ~#~ Castlehill Court Wattle Downs  Manukau City  Garage Garaging  Internal Access Garaging  Double Garaging  Off Street Parking Garaging  Brick Exterior  Combined Kitchen Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Level Section Con  Concrete Tile Roof  Pantry Features  Concrete Base  Fully Fenced Fencing  Separate Laundry Rooms  Separate Lounge Rooms  Dining Room Rooms  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Waste Disposal Unit Chattels  Refrigerator Chattels  Other Chattels ...",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 683,
      "pendingLiveDate": "2024-10-14T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:00:00+00:00",
      "auctionLocation": "Highbrook Drive",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-15T03:43:19+00:00"
    },
    {
      "listingNumber": 900111,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Apartment",
      "geoLat": -36.879543,
      "geoLong": 174.79846,
      "geoCodeWgs": "POINT (174.79847717285156 -36.879543304443359)",
      "street": "6/19 Victoria Avenue",
      "streetNumber": "6/19",
      "streetOnly": "Victoria Avenue",
      "suburb": "Remuera",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7mff9.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mhrg.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mffb.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mffe.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7mffa.jpg"
      ],
      "imageCount": 22,
      "video": "www.youtube.com/embed/VHcgqcRPtEQ?rel=0",
      "price": "$5,650,000",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "Unparalleled Luxury Living in the Heart of Remuera",
      "adSummary": "Step into a world of uncompromising elegance with this breathtaking penthouse apartment, nestled in the prestigious Ridgeview complex, just metres from the iconic Remuera shops. This 1970s apartment has just received significant updates, including a full renovation of the common areas and elevator, elevating the entire building with sleek, contemporary finishes. This is not just a home, but a lifestyle - an exclusive opportunity to indulge in the finest that Remuera has to offer.\n\nSpanning an expansive floor area, this newly renovated apartment showcases a seamless blend of high-end design and functional sophistication. Every inch of this home has been meticulously crafted with the finest finishes to evoke luxury and comfort. The stunning interior is anchored by a designer kitchen that will inspire your culinary creativity, complete with top-tier appliances and generous scullery exudes understated elegance. The warmth of solid oak flooring throughout adds a touch of timeless charm.\n\nThis penthouse offers more than just aesthetic appeal - it boasts three spacious bedrooms, including a master suite. With its walk-in wardrobe and en-suite bathroom, the master bedroom is your private sanctuary, perfectly designed for relaxation and rejuvenation.\n\nThe heart of this home is its open-plan living area, where light and space blend harmoniously to create a welcoming and versatile environment. Large glass doors lead to the enclosed loggia-style terrace and expansive north-facing deck, where you'll be captivated by panoramic views that stretch across the sparkling waters of the Harbour, past the Rangitoto Island, and across the vibrant city skyline. This space offers the ultimate setting for entertainment and relaxation.\n\nPracticality meets luxury with secure access through two undercover lock-up car parks, complete with elevator convenience that delivers you directly to your door. A generously sized storage room adds an extra layer of functionality.\n\nDon’t miss out on this rare chance to own a piece of Remuera’s most sought-after real estate. This penthouse isn’t just a home - it's an experience, and it’s waiting for you. ~#~ Unparalleled Luxury Living in the Heart of Remuera ~#~ Victoria Avenue Remuera  Auckland City  Garage Garaging  Garaging Other Garaging  Concrete Exterior  Open Plan Dining  Designer Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Aluminium Joinery  City Views  Sea Views  Level Section Con  Color Steel Roof  Pantry Features  Walk-in Wardrobe Features  Other Features Features  Concrete Base  Family Rooms  Sunroom Rooms  Rooms Other Rooms  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Waste Disposal Unit Chattels  Refrigerator ...",
      "overlay": "",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1965,
      "pendingLiveDate": "2024-10-22T11:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-22T13:30:26+00:00"
    },
    {
      "listingNumber": 897979,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.89121,
      "geoLong": 174.69843,
      "geoCodeWgs": "POINT (174.69844055175781 -36.891212463378906)",
      "street": "17  Henry Street",
      "streetNumber": "17",
      "streetOnly": "Henry Street",
      "suburb": "Avondale",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7kr5a.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kr58.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kr57.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kr59.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kr5b.jpg"
      ],
      "imageCount": 20,
      "video": "www.youtube.com/embed/SUQvPi_L6nA?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-18T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 1,
      "parkingCount": 2,
      "adHeadline": "YOUR NEW HOME SWEET HOME!",
      "adSummary": "Introducing a charming 1920’s-character bungalow in the heart of Avondale!\n\nThis delightful property is decorated in a neutral colour scheme that will suit most décor, leaving little for you to do but add your own touches and artwork.\n\nThe spacious floor plan provides a large living room that flows through to the dining area and kitchen perfect for entertaining, with a seamless flow to the private enclosed front garden - ideal for alfresco dining on warm summer evenings, or bbq’s with family and friends.\n\nThere's a versatile space downstairs for the kids to hang out with friends, a home office, or additional storage plus a separate laundry.\n\nWith three spacious bedrooms and one well-appointed bathroom, plus an extra toilet for added convenience, this home is perfect for families or professionals looking for a stylish and comfortable living space.\n\nPositioned handy to all amenities, public transport to the CBD and good schooling.\n\nThis is a fantastic opportunity to make this lovely property your new home.\n\n Contact today to schedule a viewing or we look forward to meeting you at one of our open homes. ~#~ YOUR NEW HOME SWEET HOME! ~#~ Henry Street Avondale  Auckland City  Off Street Parking Garaging  Weatherboard Exterior  Open Plan Dining  Modern Kitchen  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Wooden Joinery  Local Views  Mixed Section Con  Longrun Roof  Spa Features  Fibrolite Base  Partially Fenced Fencing  Fencing Other Fencing  Family Rooms  Rumpus Rooms  Dining Room Rooms  Kent Style Fire Heating  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Burglar Alarm ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "AUCTION TOMORROW",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 435,
      "pendingLiveDate": "2024-10-13T11:00:00+00:00",
      "auctionDateTime": "2024-11-04T23:00:00+00:00",
      "auctionLocation": "Blockhouse Bay Branch",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-13T13:30:29+00:00"
    },
    {
      "listingNumber": 900009,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Lifestyle",
      "geoLat": -37.12636,
      "geoLong": 174.94658,
      "geoCodeWgs": "POINT (174.94659423828125 -37.126365661621094)",
      "street": "831 Runciman Road",
      "streetNumber": "831",
      "streetOnly": "Runciman Road",
      "suburb": "Ramarama",
      "region": "Franklin District",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7jx76.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jx56.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jx5a.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jx59.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jx57.jpg"
      ],
      "imageCount": 43,
      "video": "www.youtube.com/embed/52lg5tCRI6I?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 5,
      "bathroomCount": 3,
      "parkingCount": 25,
      "adHeadline": "RENOVATED HOME, POOL + EXCEPTIONAL SHEDDING",
      "adSummary": "Solar powered gates invite access to this 320 square metre two storey double glazed timber\nweatherboard and brick home with colour steel roof located at the end of a long driveway in a private peaceful position well off the road. This property has been well loved and meticulously cared for by the same owners for 32 years however, as the time has come to move on, they have purchased elsewhere and need to move in the immediate future offering you the opportunity to acquire this uniquely equipped asset. Endowed with an amazing selection of shedding, there is a huge 289m 2 (approx) shed with 6m high door and two smaller doors suitable for trucks or heavy equipment, high amp single phase power, LED and flood lights, ready to accommodate all manner of projects, whether it be a business or hobby. In addition, there is a 96m 2 (approx) American barn-style free-standing garage/shed with three doors, power and lighting.\n\nPrestigiously located in high calibre company, the 4.22 hectare property, zoned Future Urban, was once equine oriented and still retains the old dressage arena. In 2015 this welcoming superbly located home underwent a glamorous transformation with modern style and functionality to the fore. At the entry an impressive pivot front door leads into open plan air-conditioned light-filled family living and the immaculate kitchen with expansive cabinetry, granite benchtops, glass splash-back, two Bosch ovens, induction cooktop, walk-in pantry and breakfast bar. Bi-fold doors here open from here to the sheltered northern section of the picturesque patio which wraps around this home offering idyllic entertaining and recreation venues. Off the living area, cavity doors open into an elegant formal lounge and dining area with high pitched timber ceiling and gas fire with feature Schist stone surrounds.\n\nOn this ground level, there’s also a well-sized home office or fifth bedroom as needed, another bedroom with built-in robe, a bathroom and a large linen press. A hallway here\nopens into the marine carpeted double lock-up garage adjoining a large laundry with benchtops, built-in storage and outdoor access. There’s also a toilet conveniently accessed from the eastern patio where a pathway leads down to the fenced salt water pool with titanium heat pump, pool cover and paved leisure surrounds. Upstairs, three bedrooms include the scenic, super-spacious master with air-conditioning, oversized walk-in robe and chic floor heated fully tiled ensuite with double vanity and super-sized shower.\nHigh pitched timber feature ceilings here and in the hallway lend a surreal sense of space. The two further bedrooms with built-in wardrobes share a contemporary family bathroom with feature tiled shower. A large multi-purpose room awaits designation – an ideal study/rumpus room or storage if required. Outdoors the amazing expansive shedding invites myriad uses, there are five paddocks, water tanks and a bore, a hay barn and garden shed and fruit trees, including citrus, avocado and plum. There’s even a trickling stream on the property’s boundary. Ticking all the boxes, this beautifully renovated property is handy to both Strathallan and St Ignatius bus routes and very convenient to the new Drury town centre development and train station coming soon. Our vendors are very keen to move and we suggest your early inspection of this prestigious, conveniently located lifestyle property.\n\n• Glamorously renovated 320m 2 residence on 4.4 ha/10.4 acres\n• Prestigious, private location. Solar electric gate entry\n• Pivot door entry to light-filled open plan family living\n• Spectacular exceptionally appointed designer kitchen\n• Bi-fold doors out to north-facing entertaining & leisure\n• Scenic wrap around patios. Wired speakers\n• Cavity doors into sophisticated formal lounge\n• Pitched timber dressed ceiling. Schist feature fireplace\n• Downstairs bedroom with built-in robes. Home office or 5th bedroom\n• Entry to double lock-up garage. Marine carpet. Powder room\n• Laundry with benchtops & storage. Outdoor access\n• Upstairs: 2 bedrooms + contemporary family bathroom\n• + Deluxe master bedroom, walk-in robe, floor-heated ensuite\n• Chic family bathroom. 6.6m x 3.8m multi-use room\n• Linen press. Gas hot water. Water filtration system\n• Fenced salt water pool/titanium heat pump/pool cover\n• 289m 2 3 door powered shed suitable for trucks\n• Plus 96m 2 American barn- style free-standing shed\n• Historical dressage arena. 5 fenced paddocks\n• Numerous species fruit trees. Garden shed. Hay barn\n• Irrigated gardens & lawns. 32,000 L water tanks & bore\n• Conveniently close to north/south motorway\n• Handy to both St Ignatius and Strathallan bus routes\n• Easy access to the upcoming Drury town centre development and train station ~#~ RENOVATED HOME, POOL + EXCEPTIONAL SHEDDING ~#~ Runciman Road Ramarama  Franklin District  Garage Garaging  More than two Garaging  Brick Exterior  Weatherboard Exterior  Combined Lounge Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Wide Views  Rural Views  Mixed Section Con  Color Steel Roof  Pantry Features  Swimming Pool Features  Walk-in Wardrobe Features  Gentle Contour  Concrete Base  Fully Fenced Fencing  Lifestyle Use  Use Other Use  Family Rooms  Separate Lounge Rooms  Dining Room Rooms  Deep Well Bore Land Chattels  Electric Fence Unit Land Chattels  Existing Water Pipes Land Chattels  Land Chattels Pumps Land Chattels  No. of Paddocks Land  Rural Feature Rural  Rural Water Farm Rural  Rural Water House Rural  Rural Water Bore Rural  Rural Water Tank Rural  Gas Heating  Heating Other Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Blinds Chattels  Pool Accessories Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Refrigerator Chattels  Other Chattels Chattels  Septic ...",
      "overlay": "AUCTION TOMORROW",
      "isGSTInclusive": true,
      "landUse": [
        "Lifestyle",
        "Use Other"
      ],
      "floorArea": 0,
      "landArea": 42209,
      "pendingLiveDate": "2024-10-06T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T00:00:00+00:00",
      "auctionLocation": "Highbrook Drive",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-07T00:35:17+00:00"
    },
    {
      "listingNumber": 900529,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.79759,
      "geoLong": 174.73296,
      "geoCodeWgs": "POINT (174.73297119140625 -36.797588348388672)",
      "street": "12 Compton Street",
      "streetNumber": "12",
      "streetOnly": "Compton Street",
      "suburb": "Hillcrest",
      "region": "North Shore City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m1ma.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m1m5.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m1m8.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m1mb.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m1me.jpg"
      ],
      "imageCount": 21,
      "video": "www.youtube.com/embed/POLzoBewtKo?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2025-02-04T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 1,
      "parkingCount": 4,
      "adHeadline": "Prime Location Across from Willow Park Primary – 12 Compton Street, Hillcrest",
      "adSummary": "Walk to School, Live in Comfort! Located directly across the road from the highly sought-after Willow Park Primary School, this single-level gem offers convenience, comfort, and endless potential for the next lucky owners.\n\nKey Features:\nSpacious 675 sqm (more or less) freehold, north-facing flat section\nTraditional Kiwi construction: Weatherboard & Concrete tile\n4 generously sized bedrooms and a family bathroom\nGourmet kitchen ideal for culinary adventures\nOpen-plan living with great indoor-outdoor flow, perfect for entertaining\n2 freestanding garages, providing ample space for vehicles, hobbies, and storage\nFully insulated with a DVS Ventilation System, ensuring year-round comfort\nPrivate, fully-fenced backyard with fruit trees, a perfect play area for kids and pets\n\nPrime Location:\nDirectly across from Willow Park Primary School , easy walking for the kids!\nClose to Monarch Park and just a 5-minute drive to Eskdale Reserve\nOnly 2.3 km from motorway access and 9.6 km to Auckland CBD\nFrequent bus services to town every 20 minutes from Willow Park School\n\nThis much-loved home has been cherished for 14 years, and now the current owners are ready to pass it on to the next family. With a C.V. of $1,600,000, they are motivated to sell, so don't miss this amazing opportunity. Bring your offer and make this fantastic property your forever home!\n\nLive a life of ease and convenience in the heart of Hillcrest, with motorway access, great shopping at Northcote & Birkenhead center, vibrant cafes, parks, and so much more right on your doorstep.\n\nContact us today for a viewing and secure your place in this desirable neighbourhood. ~#~ Prime Location Across from Willow Park Primary – 12 Compton Street, Hillcrest ~#~ Compton Street Hillcrest  North Shore City  Garage Garaging  Double Garaging  Carport Garaging  Weatherboard Exterior  Open Plan Dining  Standard Kitchen  Sep Bathrooms Bathrooms  Wooden Joinery  Local Views  Level Section Con  Concrete Tile Roof  Decking Features  Pole Base  Fully Fenced Fencing  Family Rooms  Dining Room Rooms  Air-conditioning Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Burglar Alarm Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-08T22:00:00+00:00",
      "overlay": "AUCTION THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 675,
      "pendingLiveDate": "2024-10-13T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T21:00:00+00:00",
      "auctionLocation": "The Promenade",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-13T21:27:43+00:00"
    },
    {
      "listingNumber": 898565,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.770027,
      "geoLong": 174.71703,
      "geoCodeWgs": "POINT (174.71702575683594 -36.7700309753418)",
      "street": "8 Fernwood Grove",
      "streetNumber": "8",
      "streetOnly": "Fernwood Grove",
      "suburb": "Bayview",
      "region": "North Shore City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7jfbc.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jfb7.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jfb5.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jfb6.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jfb2.jpg"
      ],
      "imageCount": 21,
      "video": "www.youtube.com/embed/enqzBYOTnPM?rel=0",
      "price": "For Sale by Tender",
      "bedroomCount": 3,
      "bathroomCount": 1,
      "parkingCount": 3,
      "adHeadline": "Amazing Property! Aptly named Birdsong",
      "adSummary": "This amazing property, presented perfectly, is a rare offering! If you’ve been searching for that special place where everything feels superior, this is the one for you!\n\nEnjoy the extensive and tasteful renovations throughout the house, completed in recent years, with fresh, high-quality paint applied inside and out. The house is fully insulated, including the ceiling, walls, and underfloor! For your utmost comfort, it also features an HRV system, an efficient heat pump, and a modern high-quality wood burner.\n\nThe vendor, a professional gardener, has transformed the space around the house into subtropical, low-maintenance gardens featuring many exotic palms, unique shrubs, and a variety of fruit trees.\n\nCome and appreciate the breathtaking beauty of the native bush reserve bordering the property. Make the most of the expansive, sunny private decking that overlooks a serene tree reserve, perfect for gatherings and BBQs. The pergola covered deck area off the dining room invites you to embrace outdoor living year round, while the lounge deck is ideal for basking in the morning and early afternoon sun.\n\nAs the new owner, you will surely enjoy the vibrant native birdlife surrounding you, from Tui and Wax Eyes to Fan Tails and Wood Pigeons, with the enchanting calls of Moreporks filling the evenings. Explore nearby bush walks through local reserves, connecting you with nature.\n\nIndulge in local amenities, including the Glenfield Recreation Centre (gym and pool), library, restaurants, cafes, and the Postmans Leg Family Bar, all with Glenfield and Albany Malls just a short drive away.\n\nAfter investing 10 years of love and care into this property, the vendors are now ready to relocate, and this unique beauty can be yours! See you at the open homes this weekend.\n\nThe tender process allows you to make a conditional offer before the deadline, including specific conditions such as finance approval, building inspection, or any other important terms. If your offer is accepted, you will have time to satisfy your conditions.\n\nAgents from all agencies are welcome to introduce your buyers! ~#~ Amazing Property! Aptly named Birdsong ~#~ Fernwood Grove Bayview  North Shore City  Garage Garaging  Single Garaging  Off Street Parking Garaging  Lockup Garaging  Hardiplank Exterior  Fibre Cement Exterior  Open Plan Dining  GAS CookTop Kitchen  Modern Kitchen  Com. Bath/WCs Bathrooms  Aluminium Joinery  Bush Views  Local Views  Mixed Section Con  Decramastic Roof  Decking Features  Polished Floors Features  Fibrolite Base  Pole Base  Partially Fenced Fencing  Separate Lounge Rooms  Kent Style Fire Heating  Heat Pump Heating  Heating Other Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Stove Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "TENDER CLOSES THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 659,
      "pendingLiveDate": "2024-10-13T11:00:00+00:00",
      "tenderDateTime": "2024-11-07T03:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T01:06:02+00:00"
    },
    {
      "listingNumber": 900523,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.910896,
      "geoLong": 174.63751,
      "geoCodeWgs": "POINT (174.63752746582031 -36.9109001159668)",
      "street": "21 Anna Lane",
      "streetNumber": "21",
      "streetOnly": "Anna Lane",
      "suburb": "Glen Eden",
      "region": "Waitakere City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m17b.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m17n.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m17k.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m17r.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m17s.jpg"
      ],
      "imageCount": 20,
      "video": "www.youtube.com/embed/XHZdeO9emlk?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 3,
      "adHeadline": "ROBUST BRICK & TILE NEEDS NEW FAMILY",
      "adSummary": "Located towards the end of a quiet and family-friendly cul-de-sac, this robust brick & tile freehold home is all ready to move straight into.\n\nStep inside and discover 3 good sized bedrooms, 2 bathrooms and a spacious open-plan kitchen/dining and lounge with excellent indoor/outdoor flow to a patio area for entertaining and a flat easy-care section.\n\nFully fenced so suitable for young children and pets, the home comes with internal access garaging and a laundry conveniently tucked away at its rear.\n\nThere is also an HRV system for all year-round comfort as well as solar panels on the roof to offset your energy costs.\n\nTicking so many boxes, this home would suit first home buyers, families looking to make that next step up, investors wanting a strong rental or those downsizing from a large property.\n\nHandy to Glen Eden Village and train station, main bus routes and Parrs Park for recreation, our vendors are motivated so don’t delay, contact us now for a viewing! ~#~ ROBUST BRICK & TILE NEEDS NEW FAMILY ~#~ Anna Lane Glen Eden  Waitakere City  Garage Garaging  Single Garaging  Off Street Parking Garaging  Brick Exterior  Combined Kitchen Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Aluminium Joinery  Urban Views  Level Section Con  Concrete Tile Roof  Block Base  Fully Fenced Fencing  Rural Water Town Rural  Ventilation System Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "AUCTION THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 351,
      "pendingLiveDate": "2024-10-14T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T13:31:12+00:00"
    },
    {
      "listingNumber": 900772,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Lifestyle",
      "geoLat": -37.31798,
      "geoLong": 174.85596,
      "geoCodeWgs": "POINT (174.85597229003906 -37.317985534667969)",
      "street": "121 Kohanga Road",
      "streetNumber": "121",
      "streetOnly": "Kohanga Road",
      "suburb": "Onewhero",
      "region": "Franklin District",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m5za.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m5zb.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m5z7.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m5zc.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m602.jpg"
      ],
      "imageCount": 22,
      "video": "www.youtube.com/embed/PXVkezIw_78?rel=0",
      "price": "For Sale by Tender",
      "bedroomCount": 3,
      "bathroomCount": 2,
      "parkingCount": 4,
      "adHeadline": "THE LIFESTYLE DREAM – PANORAMIC VIEWS!",
      "adSummary": "Bags Are Packed – Relocating to the Beach\n\nDiscover the epitome of countryside living in this charming home that seamlessly blends modern comfort with breathtaking 180-degree views! Nestled in a tranquil countryside setting, this beautiful lifestyle property offers a unique opportunity to live the lifestyle of your dreams..\n\nStep inside, and you'll be greeted by a spacious and well-designed layout with family and entertaining in mind. You’ll be spoilt with views that stretch from the Awhitu Peninsula and Sky Tower to the Waikato River and the Bombay Hills.. The large, north-facing deck is perfect for alfresco dining with ambient lighting with an awning for sun protection, making it the ideal spot to take in stunning West Coast sunsets!\n\nInside, you’ll stay cozy all year-round with a Kent fireplace, a recently installed heat pump and a heat transfer system for complete comfort. Recently refreshed with new carpet throughout the home and stylish new curtains in the living area ensuring modern class!\n\nMake your dream lifestyle a reality and seize this chance to own a property that embodies the beauty of both nature and personalized design. Don't miss out on this extraordinary opportunity!\n\n- 3 Bedrooms + Study – 2004 Country Home\n- 2 Bathrooms – Including ensuite + Separate Toilet\n- Stunning Setting, Expansive Countryside Views\n- Modern Kitchen With Butlers Pantry\n- Open Plan Layout, Indoor/Outdoor Flow\n- Comfortable Living Spaces, Wood Burner, Heat Pump + Transfer System\n- Covered Entertainment Area, Alfresco Dining, Entertainers Dream\n- Renovated/Well Maintained – Move In & Enjoy!\n- 1 ha = 2.5 Acres (Approx), 3 Paddocks\n- Established Grounds, Large Yard Area For Kids\n- Internal Double Garage, Plus Additional 6x6m Workshop\n- Abundance Of Fruit Trees\n- Nearby Local Schools\n- Short Drive To Local Beach & Boat Ramps.\n- Only 25mins to Pukekohe, 12mins to Tuakau (approx.)\n- Central for Auckland and Hamilton Commuters ~#~ THE LIFESTYLE DREAM – PANORAMIC VIEWS! ~#~ Kohanga Road Onewhero  Franklin District  Garage Garaging  Internal Access Garaging  Double Garaging  Free Standing Garaging  Garaging Other Garaging  Hardiplank Exterior  Combined Lounge Dining  Modern Kitchen  Butlers Pantry Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Bush Views  Wide Views  Rural Views  View Other Views  Sloping Section Con  Iron Roof  Decking Features  Walk-in Wardrobe Features  Gentle Contour  Pole Base  Fully Fenced Fencing  Lifestyle Use  Separate Laundry Rooms  Office/Study Rooms  Workshop Rooms  Electric Fence Unit Land Chattels  Existing Water Pipes Land Chattels  Land Chattels Pumps Land Chattels  No. of Paddocks Land  Yards Land  Rural Feature Rural  Rural Water House Rural  Rural Water Tank Rural  Kent Style Fire Heating  Heating Other Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Stove Chattels  Other Chattels Chattels  Septic Sewage  Other ...",
      "overlay": "TENDER CLOSES THURSDAY",
      "isGSTInclusive": true,
      "landUse": [
        "Lifestyle"
      ],
      "floorArea": 0,
      "landArea": 10000,
      "pendingLiveDate": "2024-10-13T11:00:00+00:00",
      "tenderDateTime": "2024-11-07T02:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-14T02:13:53+00:00"
    },
    {
      "listingNumber": 900093,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Unit",
      "geoLat": -36.89506,
      "geoLong": 174.75128,
      "geoCodeWgs": "POINT (174.75129699707031 -36.895061492919922)",
      "street": "1C Bathurst Road",
      "streetNumber": "1C",
      "streetOnly": "Bathurst Road",
      "suburb": "Mt Eden",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7jwat.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jwak.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jwam.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jwap.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jwan.jpg"
      ],
      "imageCount": 14,
      "video": "www.youtube.com/embed/yR7S8ZXUxLc?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 1,
      "bathroomCount": 1,
      "parkingCount": 1,
      "adHeadline": "Auction this Wednesday 1.30pm 6th November",
      "adSummary": "This stunning 1930s Art Deco end unit is everything you’ve been searching for. Situated in a well-maintained block of four, this beautifully renovated, single-level home offers charm, convenience, and low-maintenance living in one of the most desirable areas of town.\n\n• Bright open-plan living area featuring polished hardwood floors\n• Modern well-appointed kitchen with quality fittings\n• Generously sized double bedroom and fully renovated bathroom\n• West-facing courtyard, perfect for relaxing or entertaining\n• Recently repainted exterior, adding to the block’s overall appeal\n• Low-maintenance and move-in ready\n\nLocated between Dominion Rd and Mount Eden Rd, this property boasts unbeatable convenience. Enjoy proximity to Mt Eden Village, Dominion and Mount Eden Road's popular eateries like Wild Wheat, Cazador, and Mr. Zhou’s just to name a few. Plus quick access to transport links and a short commute to the CBD.  In zone for Maungawhau and Balmoral Schools, Auckland Normal Intermediate and Mt Albert Grammar.\n\nWhether you're an investor seeking a solid rental opportunity, a first-time buyer looking for a low-maintenance, centrally located home or a downsizer looking for a lock up and leave, this is the one! Everything is done – just move in and enjoy.\n\nDon’t miss out – call today to arrange a viewing or visit me at the open homes ~#~ Auction this Wednesday 1.30pm 6th November ~#~ Bathurst Road Mt Eden  Auckland City  Off Street Parking Garaging  Concrete Block Exterior  Combined Lounge Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Wooden Joinery  Local Views  Level Section Con  Concrete Base  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Rangehood Chattels  Blinds Chattels  Other Chattels ...",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 0,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:30:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-15T13:31:33+00:00"
    },
    {
      "listingNumber": 898610,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.88412,
      "geoLong": 174.77142,
      "geoCodeWgs": "POINT (174.77142333984375 -36.884120941162109)",
      "street": "103A Ranfurly Road",
      "streetNumber": "103A",
      "streetOnly": "Ranfurly Road",
      "suburb": "Epsom",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m82z.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m836.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m83a.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m83e.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m82y.jpg"
      ],
      "imageCount": 25,
      "video": "www.youtube.com/embed/KqyZN8SdPzw?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-28T11:00:00+00:00",
      "bedroomCount": 5,
      "bathroomCount": 3,
      "parkingCount": 4,
      "adHeadline": "Modern Family Living – Must Be Sold",
      "adSummary": "This contemporary home, with striking street appeal, sits on a 436m² section with its own driveway in a quiet cul-de-sac. The location is superb, just a short walk from top-rated schools. Built with a durable concrete block and weatherboard exterior, this home offers both quality and longevity.\n\nSpanning approximately 270m², the property features 5 bedrooms, 3 bathrooms, 3 living areas, and a double garage. You'll be impressed by the grand entryway and the luxury of underfloor heating throughout. The modern, state-of-the-art gourmet kitchen is perfect for entertaining.\n\nZoned for Kohia Terrace School, ANI, AGS, and EGGS, and close to Dio and St Cuthbert's, it’s ideal for families. Just a short drive to Westfield Newmarket for shopping, dining, and entertainment.\n\nOverseas vendors – MUST BE SOLD. ~#~ Modern Family Living – Must Be Sold ~#~ Ranfurly Road Epsom  Auckland City  Garage Garaging  Double Garaging  Off Street Parking Garaging  Weatherboard Exterior  Open Plan Dining  Designer Kitchen  Ensuite Bathrooms  Com. Bath/WCs Bathrooms  Aluminium Joinery  Local Views  Level Section Con  Decking Features  Polished Floors Features  Walk-in Wardrobe Features  Concrete Base  Fully Fenced Fencing  Family Rooms  Separate Lounge Rooms  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Rangehood Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Refrigerator Chattels  Central Vac System Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T01:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 436,
      "pendingLiveDate": "2024-10-07T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T21:00:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-07T13:30:52+00:00"
    },
    {
      "listingNumber": 898862,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.802876,
      "geoLong": 174.7332,
      "geoCodeWgs": "POINT (174.73320007324219 -36.802875518798828)",
      "street": "35 Raymond Terrace",
      "streetNumber": "35",
      "streetOnly": "Raymond Terrace",
      "suburb": "Northcote",
      "region": "North Shore City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7kkzs.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kkzy.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7k5pp.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7kkzz.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7jjd5.jpg"
      ],
      "imageCount": 22,
      "video": "www.youtube.com/embed/HYoFHfJ705g?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 4,
      "adHeadline": "Europe Calling - Must Sell",
      "adSummary": "Imagine coming home to a place where every view feels like a warm embrace, where panoramic views of the city, the harbour, and the native bush greet you with open arms. This is the kind of personal sanctuary that awaits you at this exquisite Northcote property.\n\nYou’re minutes away from the CBD, motorway system, boutique shops and popular restaurants of Takapuna and Birkenhead.\n\nSchool pupils can easily walk to schools over the new beautifully constructed world class bush-top walkway with stunning forest views of 300-year-old kauri and other indigenous trees which is home to abundant bird life.\n\nWith 4 bedrooms, 2 bathrooms and an internal accessible garage this property is designed to cater for your every need, making you feel right at home from the moment you step inside.\n\nThe lower living area can have many uses, possible accommodation for family members, home office or your own private hobbies den.\n\nStep into the heart of the home, the modern step saver kitchen where wide views and a gas hob invites you to create fast and tasty meals filled with love and comfort.\n\nThe open plan living area is a welcoming space that beckons you together with your loved ones and creates lasting memories.\n\nRelax and rejuvenate in the secluded swimming pool and spa, a private haven where you can unwind and recharge after the day’s challenges.\n\nLet this be the place where you can truly be yourself. Reach out to us today and start envisioning your future in this special property which has to be sold.\n\nDon't let this one get away!\n\nCall us now or come along to the advertised open homes. ~#~ Europe Calling - Must Sell ~#~ Raymond Terrace Northcote  North Shore City  Garage Garaging  Single Garaging  Off Street Parking Garaging  Weatherboard Exterior  Open Plan Dining  GAS CookTop Kitchen  Modern Kitchen  Sep Bathrooms Bathrooms  Aluminium Joinery  City Views  Bush Views  Local Views  Wide Views  Sloping Section Con  Color Steel Roof  Decking Features  Pantry Features  Swimming Pool Features  Spa Features  Block Base  Fully Fenced Fencing  Family Rooms  Separate Laundry Rooms  Rumpus Rooms  Attic Rooms  Dining Room Rooms  Heat Pump Heating  Wood Fire Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Rangehood Chattels  Pool Accessories Chattels  Dishwasher Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T00:00:00+00:00",
      "overlay": "AUCTION THURSDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 1072,
      "pendingLiveDate": "2024-10-09T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T21:00:00+00:00",
      "auctionLocation": "The Promenade",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-09T20:47:31+00:00"
    },
    {
      "listingNumber": 899766,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Section",
      "geoLat": -36.90795,
      "geoLong": 174.79607,
      "geoCodeWgs": "POINT (174.79606628417969 -36.907951354980469)",
      "street": "37  Rawhiti Road",
      "streetNumber": "37",
      "streetOnly": "Rawhiti Road",
      "suburb": "One Tree Hill",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m7pv.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7pg.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7ny.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7pn.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7p0.jpg"
      ],
      "imageCount": 26,
      "video": "www.youtube.com/embed/HTVDk3MWa7U?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-28T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 3,
      "adHeadline": "Delightful Family Home with Expansive Views",
      "adSummary": "Nestled in the highly desirable One Tree Hill, this charming two-level home is perfect for families, first-home buyers, or investors looking for a smart entry into the property market.\n\nWith 4 spacious bedrooms and 2 living rooms, this newly painted home provides enough room for everyone to enjoy their privacy. The main living area flows effortlessly into the open-plan kitchen and dining, with seamless access to a large deck—an ideal spot for outdoor dining or evening relaxation. From here, you are treated to sweeping panoramic views that span across the city and extend all the way to the serene Manukau Harbour. The breathtaking scenery offers daily sunrises and sunsets that fill your world with beauty and tranquility.\n\nThe lower level features a separate entrance, complete with a generous bedroom, bathroom, and additional space that can be used as a rumpus room or a teenage retreat. This setup is perfect for extended family or even a boarder seeking privacy, with flexible space that can easily adapt to your family’s needs.\n\nJust a short stroll from the lush Cornwall Park, this home is not only conveniently located with amenities just minutes away but also enjoys an elevated position that floods the house with natural light. The expansive views from this height create a sense of openness and peace, as you gaze over the suburbs, distant hills, and sky—truly a sanctuary in the city.\n\nThe owner is highly motivated to sell, and this is an opportunity you won’t want to miss. Come and experience this extraordinary view for yourself! ~#~ Delightful Family Home with Expansive Views ~#~ Rawhiti Road One Tree Hill  Auckland City  Garage Garaging  Double Carport Garaging  Carport Garaging  Concrete Exterior  Open Plan Dining  Modern Kitchen  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Mixed Joinery  Wide Views  Sloping Section Con  Iron Roof  Concrete Base  Not Fenced Fencing  Family Rooms  Separate Lounge Rooms  Office/Study Rooms  Dining Room Rooms  Heat Pump Heating  Wood Fire Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 0,
      "pendingLiveDate": "2024-10-09T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T04:30:00+00:00",
      "auctionLocation": "Epsom Branch",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-09T13:31:22+00:00"
    }
  ]
}