{
  "pagination": {
    "pageNumber": 1,
    "pageSize": 50
  },
  "results": [
    {
      "listingNumber": 901126,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Lifestyle",
      "geoLat": -36.670277,
      "geoLong": 174.65317,
      "geoCodeWgs": "POINT (174.65318298339844 -36.6702766418457)",
      "street": "10 Dairy Stream Road",
      "streetNumber": "10",
      "streetOnly": "Dairy Stream Road",
      "suburb": "Dairy Flat",
      "region": "Rodney District",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7msgr.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7msgs.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7msgt.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7msgv.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7msgw.jpg"
      ],
      "imageCount": 30,
      "video": "www.youtube.com/embed/4megbmY3AAc?rel=0",
      "price": "For Sale by Tender",
      "settlementDate": "2025-03-10T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 2,
      "adHeadline": "Stunning Lifestyle in Future Urban Zone",
      "adSummary": "This is an incredibly rare opportunity to own a stunning estate in the heart of Dairy Flat. Not only does it offer the full experience of luxurious estate living, but it also allows you to landbank for a future with unlimited investment potential.\n\nSet back from the main road, it is quiet and private. The nearly square-shaped, gently rolling 3.1245 hectares of land is bathed in sunlight all day and surrounded by breathtaking scenery. The current owners, who have lived here for over 20 years, have perfectly designed the layout of the estate according to the land’s unique features, meticulously maintaining the gardens and managing the pastures, all while enjoying a peaceful, idyllic rural lifestyle.\n\nThe home meets almost all your desires for a relaxing lifestyle. Every room, from the lounge, kitchen, and living room to each bedroom, offers beautiful views of the garden. The spacious living area includes a large lounge, open-plan kitchen with walk-in pantry, and a cozy family living room, providing a comfortable and expansive leisure space. Downstairs, there are three large bedrooms, a shared bathroom, a separate toilet, and a double garage. Upstairs is the master’s private living space, featuring a spacious master bedroom with an ensuite, a walk-in wardrobe, and a connecting balcony with scenic views.\n\nThe location is excellent, situated in the core of Dairy Flat, just a few minutes drives to Albany Mega Centre, and the central of Silverdale/Millwater. ~#~ Stunning Lifestyle in Future Urban Zone ~#~ Dairy Stream Road Dairy Flat  Rodney District  Garage Garaging  Double Garaging  Brick Exterior  Open Plan Dining  Modern Kitchen  Sep Bathrooms Bathrooms  Ensuite Bathrooms  Sep WC's Bathrooms  Aluminium Joinery  Local Views  Mixed Section Con  Metal Tile Roof  Spa Features  Concrete Base  Fully Fenced Fencing  Lifestyle Use  Family Rooms  Separate Lounge Rooms  Dining Room Rooms  Land Chattels Pumps Land Chattels  Rural Water Tank Rural  Kent Style Fire Heating  Heating Other Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Stove Chattels  Other Chattels Chattels  Septic ...",
      "nextOpenHome": "2024-11-09T23:00:00+00:00",
      "overlay": "",
      "isGSTInclusive": true,
      "landUse": [
        "Lifestyle"
      ],  
      "floorArea": 0,
      "landArea": 31245,
      "pendingLiveDate": "2024-10-21T11:00:00+00:00",
      "tenderDateTime": "2024-11-10T23:00:00+00:00",
      "auctionLocation": "",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-21T19:45:35+00:00"
    },
    {		
      "listingNumber": 898666,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.885662,
      "geoLong": 174.7644,
      "geoCodeWgs": "POINT (174.76441955566406 -36.885665893554688)",
      "street": "48 Disraeli Street",
      "streetNumber": "48",
      "streetOnly": "Disraeli Street",
      "suburb": "Mt Eden",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m4t0.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4tt.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4ts.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4t4.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m4t5.jpg"
      ],
      "imageCount": 14,
      "video": "www.youtube.com/embed/ThnWrJ7D5sA?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2025-03-05T11:00:00+00:00",
      "bedroomCount": 5,
      "bathroomCount": 3,
      "parkingCount": 6,
      "adHeadline": "Double Grammar - 986m2 MHSZ",
      "adSummary": "Welcome families, lifestlyers and entertainers...here is the home of your dreams!\n\nThis large elevated Art Deco property plus the 2 storey garden cottage offer all who live here extraordinary living. Loved for the past 16 years by an award winning interior designer and her creative hubby, curated spaces are jam packed with thoughtful design, fabulous views and splashes of colour - every corner of this home is just delicious! Beautifully set on 986m2 of North facing outdoor living and gardens...you have just found your very own House of Fun!\n\n• Large garden cottage for extended living, games room and/or work from home\n• 986m2\n• Ample off street parking\n• Zones: Kohia Terrace; ANI; Epsom Girls Grammar; Auckland Grammar ~#~ Double Grammar - 986m2 MHSZ ~#~ Disraeli Street Mt Eden  Auckland City  Off Street Parking Garaging  Double Carport Garaging  Carport Garaging  Plaster Exterior  Brick Exterior  Combined Kitchen Dining  Designer Kitchen  Sep Bathrooms Bathrooms  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Mixed Joinery  Wide Views  Mixed Section Con  Slate Tile Roof  Polished Floors Features  Wooden Base  Concrete Base  Partially Fenced Fencing  Family Rooms  Separate Laundry Rooms  Separate Lounge Rooms  Office/Study Rooms  Heat Pump Heating  Curtains Chattels  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Garden Shed Chattels  Blinds Chattels  Dishwasher Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Refrigerator Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T01:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 986,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T00:30:00+00:00",
      "auctionLocation": "34 Shortland St",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-15T13:31:05+00:00"
    },
    {
      "listingNumber": 899570,	  
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "House",
      "geoLat": -36.87511,
      "geoLong": 174.7589,
      "geoCodeWgs": "POINT (174.75889587402344 -36.8751106262207)",
      "street": "29 Bellevue Road",
      "streetNumber": "29",
      "streetOnly": "Bellevue Road",
      "suburb": "Mt Eden",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m7hp.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7ht.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7ky7v.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7hv.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m08e.jpg"
      ],
      "imageCount": 30,
      "video": "www.youtube.com/embed/-jfKayR7Oq0?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-12-05T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 7,
      "adHeadline": "Stunning Mt Eden Villa in DGZ",
      "adSummary": "Your family lifestyle upgrade is here with this very special modernised villa in the coveted triple Grammar zone and walking distance to the village.\n\nRevel in spacious and sophisticated living with two separate lounges, four bedrooms, two bathrooms and an excellent connection between indoors and out. Crisp contemporary styling throughout highlights the classic polished timber floors that flow through to the substantial main open plan living, kitchen and dining at the rear. \n\nCentred by the well-appointed gourmand’s kitchen with quality appliances, abundant storage and an elongated breakfast bar for informal gatherings, the whole space spills out seamlessly to the north-facing deck and established, low-maintenance garden. With a distinctly tropical vibe, this is the dream private entertainer’s zone. Young families will appreciate the flat lawn, ideal for kicking a ball and building memories.\n\nFlexible, comfortable living spaces include a second lounge for quiet movie nights together, while the plush master bedroom provides a private retreat with beautifully tiled ensuite and a walk-in-robe. Three further bedrooms all come with built-in wardrobes, serviced by a striking family bathroom.\n\nPerfectly positioned on 558sqm and move-in ready, this magical family home also benefits from a heat pump, secure double garage plus ample off-street parking for five cars. Enjoying easy access to schools including Mt Eden Primary, parks, shops and the vibrant cafe culture of Mt Eden Village, and with Eden Park and the city nearby, lifestyle and convenience are assured. Don’t delay viewing this serene sanctuary. ~#~ Stunning Mt Eden Villa in DGZ ~#~ Bellevue Road Mt Eden  Auckland City  Garage Garaging  Double Garaging  Off Street Parking Garaging  Weatherboard Exterior  Combined Lounge Dining  Combined Kitchen Dining  Modern Kitchen  Ensuite Bathrooms  Com. Bath/WCs Bathrooms  Wooden Joinery  Local Views  Private Views  Level Section Con  Color Steel Roof  Decking Features  Polished Floors Features  Walk-in Wardrobe Features  Other Features Features  Wooden Base  Fully Fenced Fencing  Family Rooms  Separate Lounge Rooms  Heat Pump Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds Chattels  Dishwasher Chattels  Garage Door Opener Chattels  Burglar Alarm Chattels  Waste Disposal Unit Chattels  Other Chattels ...",
      "nextOpenHome": "2024-11-09T01:00:00+00:00",
      "overlay": "AUCTION TOMORROW",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 558,
      "pendingLiveDate": "2024-10-15T11:00:00+00:00",
      "auctionDateTime": "2024-11-05T03:00:00+00:00",
      "auctionLocation": "Mt Eden Branch",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-20T20:10:44+00:00"
    },
    {
      "listingNumber": 899766,
      "lineOfBusiness": "R",
      "status": "A",
      "propertyType": "Section",
      "geoLat": -36.90795,
      "geoLong": 174.79607,
      "geoCodeWgs": "POINT (174.79606628417969 -36.907951354980469)",
      "street": "37  Rawhiti Road",
      "streetNumber": "37",
      "streetOnly": "Rawhiti Road",
      "suburb": "One Tree Hill",
      "region": "Auckland City",
      "images": [
        "https://blobmedia.barfoot.co.nz/r3/images/7m7pv.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7pg.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7ny.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7pn.jpg",
        "https://blobmedia.barfoot.co.nz/r3/images/7m7p0.jpg"
      ],
      "imageCount": 26,
      "video": "www.youtube.com/embed/HTVDk3MWa7U?rel=0",
      "price": "For Sale by Auction",
      "settlementDate": "2024-11-28T11:00:00+00:00",
      "bedroomCount": 4,
      "bathroomCount": 2,
      "parkingCount": 3,
      "adHeadline": "Delightful Family Home with Expansive Views",
      "adSummary": "Nestled in the highly desirable One Tree Hill, this charming two-level home is perfect for families, first-home buyers, or investors looking for a smart entry into the property market.\n\nWith 4 spacious bedrooms and 2 living rooms, this newly painted home provides enough room for everyone to enjoy their privacy. The main living area flows effortlessly into the open-plan kitchen and dining, with seamless access to a large deck—an ideal spot for outdoor dining or evening relaxation. From here, you are treated to sweeping panoramic views that span across the city and extend all the way to the serene Manukau Harbour. The breathtaking scenery offers daily sunrises and sunsets that fill your world with beauty and tranquility.\n\nThe lower level features a separate entrance, complete with a generous bedroom, bathroom, and additional space that can be used as a rumpus room or a teenage retreat. This setup is perfect for extended family or even a boarder seeking privacy, with flexible space that can easily adapt to your family’s needs.\n\nJust a short stroll from the lush Cornwall Park, this home is not only conveniently located with amenities just minutes away but also enjoys an elevated position that floods the house with natural light. The expansive views from this height create a sense of openness and peace, as you gaze over the suburbs, distant hills, and sky—truly a sanctuary in the city.\n\nThe owner is highly motivated to sell, and this is an opportunity you won’t want to miss. Come and experience this extraordinary view for yourself! ~#~ Delightful Family Home with Expansive Views ~#~ Rawhiti Road One Tree Hill  Auckland City  Garage Garaging  Double Carport Garaging  Carport Garaging  Concrete Exterior  Open Plan Dining  Modern Kitchen  Sep WC's Bathrooms  Com. Bath/WCs Bathrooms  Mixed Joinery  Wide Views  Sloping Section Con  Iron Roof  Concrete Base  Not Fenced Fencing  Family Rooms  Separate Lounge Rooms  Office/Study Rooms  Dining Room Rooms  Heat Pump Heating  Wood Fire Heating  Light Fittings Chattels  Fixed Floor Coverings Chattels  Cooktop/Oven Chattels  Extractor Fan Chattels  Heated Towel Rail Chattels  Rangehood Chattels  Blinds ...",
      "nextOpenHome": "2024-11-08T23:00:00+00:00",
      "overlay": "AUCTION WEDNESDAY",
      "isGSTInclusive": true,
      "landUse": [],
      "floorArea": 0,
      "landArea": 0,
      "pendingLiveDate": "2024-10-09T11:00:00+00:00",
      "auctionDateTime": "2024-11-06T04:30:00+00:00",
      "auctionLocation": "Epsom Branch",
      "auctionRoomNumber": 0,
      "auctionLotNumber": 0,
      "majorChangeDate": "2024-10-09T13:31:22+00:00"
    }
  ]
}